{"article_id": "20251002164500-0", "source_url": "https://www.bristolpost.co.uk/news/bristol-news/gunman-run-after-drive-shooting-10544956", "published_at": "2025-10-02T16:45:00", "text": "A gun was fired from a car, sparking a huge emergency response at an industrial estate.\n\nArmed police officers rushed to Lufton Trading Estate, in Yeovil, at 12.45pm on Wednesday, October 1, after afirearm was dischargedfrom an occupant of a vehicle.\n\nThe suspects quickly fled the scene and, despite police searches, no one has yet been found or arrested.\n\nThe car believed to be involved, a red 4x4, has been seized by Avon and Somerset Police.\n\nA large police presence carried out searches, with armed police officers and the National Police Air Service helicopter deployed across Yeovil.\n\nAvon and Somerset Police say they believe there is no wider risk to the public.\n\nInspector Roseanna Green said: \"We know the news of this incident is likely to cause concern, but we'd like to reassure everyone we have not found any information to suggest there is a wider risk to the general public.\n\n\"Officers remain at the scene today carrying out vital work as part of this investigation. Detectives are following up on all lines of enquiry to track down those responsible.\n\n\"To make sure we are there for the community, extra patrols are planned in the area.\n\n\"Anyone with concerns is urged to speak to those officers who will be happy to stop, listen and support where possible.\"\n\nThe force has asked anyone with information to get in contact. Avon and Somerset Police said in a statement: \"An investigation is underway following an incident involving a firearm in Yeovil yesterday (Wednesday 1 October).\n\n\"Nobody was injured, however we received a report of a firearm being discharged from a car in the Lufton Trading Estate at about 12.45pm. Those responsible quickly left the scene in the same car.\n\n\"Searches of the nearby area were out by firearms officers on the ground with the support of the National Police Air Service helicopter, but proved negative.\n\n\"A car believed to be have used in the incident, a red 4X4, has since been located and seized.\n\n\"We'd ask anyone else with information, or relevant footage from the area, to please contact us on 101 and quote reference number 5225275680. Alternatively, please contact Crimestoppers anonymously on 0800 555111 or via its website.\"\n\nAtReach and across our entitieswe and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the saleor sharing of your data, at any time clicking the &quot;Do Not Sell or Share my Data&quot; button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in ourPrivacy NoticeandPrivacy Notice."}
{"article_id": "20251002164500-1", "source_url": "https://www.uwyo.edu/news/2025/10/wyoming-biz-tips-for-october.html", "published_at": "2025-10-02T16:45:00", "text": "Academics\n\nStudent Life\n\nWhere We Shine\n\nQuick Links\n\nPublished October 02,  2025\n\nAn occasional look at issues facing Wyoming business owners and entrepreneurs from\n                              the Wyoming Small Business Development Center (SBDC) Network, a collection of business\n                              assistance programs at the University of Wyoming.\n\nBy Paul Johnson, cybersecurity program manager, Wyoming SBDC Network\n\nThe bad news: A cyberattack could not only slow down your small business; it could\n                              ruin it. Over 90 percent of small businesses were targeted by cybercriminals in 2024.\n                              Some businesses survive, but 60 percent of small businesses that experienced a cyberattack\n                              closed within six months. The good news: Simple preparations can make your business\n                              a less vulnerable target for cybercriminals.\n\nThe reasons that a cyberattack can kill your business are both financial and reputational.\n                              A data breach can cost tens or hundreds of thousands of dollars in recovery costs\n                              and close your doors while you solve the issues. Once you or your customers’ records\n                              have been hacked and exposed, your reputation may never recover.\n\nCybersecurity insurance may help you recover financially from a cyberattack, but your\n                              company’s credibility and trustworthiness may not be repaired. Your best defense against\n                              cyberattacks is knowledge and preparedness.\n\nThe Wyoming SBDC Network’s Cybersecurity for Small Business Program can help your\n                              business put simple measures in place to make you less attractive to hackers and a\n                              difficult target to attack. The program provides no-cost, comprehensive advising in\n                              a variety of areas to help your business build a cyber readiness shield for your business:\n\n-- Complete cybersecurity situation assessment.\n\n-- Hardware/software inventory.\n\n-- System configuration review and suggestions.\n\n-- Employing training and ongoing maintenance strategy.\n\n-- Incident response plan creation.\n\n-- Administrative and personnel policy creation/review.\n\nThe program, funded fully by the U.S. Small Business Administration (SBA) and staffed\n                              by highly trained cybersecurity business advisers, requires some of your valuable\n                              time -- but none of your money. Throughout a series of meetings and independent work,\n                              small businesses will put a complete cyber readiness plan in place as quickly as they\n                              would like to move through the program. Some clients work with us for months; others\n                              move through in a few weeks.\n\nOver the last two years, our Cybersecurity Program for Small Business has assisted\n                              over 80 Wyoming small businesses with various cybersecurity issues, and over 25 have\n                              completed our comprehensive advising program.\n\nIf you’re interested in working through our complete program or need assistance with\n                              a specific cybersecurity issue, email Program Manager Paul Johnson atpjohns45@uwyo.edu, or visitwww.wyomingsbdc.org/cybersecurity-program. We’ve assisted companies with Facebook hijacking, phishing attacks and staff cyber\n                              readiness training. We’ve also provided advising and assistance to companies that\n                              need to be cyber compliant to apply for government contracting.\n\nThe most basic cyber readiness practices do not require a great deal of technological\n                              expertise and can make your company much less of a target for cybercriminals. The\n                              best way to protect your business is to be prepared.\n\nThe Wyoming SBDC Network offers no-cost advising and technical assistance to help\n                              Wyoming entrepreneurs think about, launch, grow, reinvent or exit their business.\n                              In 2024, the Wyoming SBDC Network helped Wyoming entrepreneurs start 46 new businesses;\n                              support 1,870 jobs; and bring a capital impact of $2.9 million to the state. The Wyoming\n                              SBDC Network is hosted by UW with state funds from the Wyoming Business Council and\n                              funded, in part, through a cooperative agreement with the U.S SBA.\n\nTo ask a question, call 1-800-348-5194, emailwsbdc@uwyo.eduor write Dept. 3922, 1000 E. University Ave., Laramie, WY 82071-3922.\n\nFor more information, gohere.\n\nAll opinions, conclusions, and/or recommendations expressed herein are those of the\n                                 author(s) and do not necessarily reflect the views of the SBA.\n\nBureau of Mines Building\n\nThe University of Wyoming has earned its Research Level 1 (R1) status from the Carnegie\n         Classification of Institutions of Higher Education, placing Wyoming's only four-year\n         university with thetop research universitiesin the United States."}
{"article_id": "20251002164500-3", "source_url": "https://en.antaranews.com/news/383857/indonesia-festival-uses-museums-to-promote-sdgs-for-youth", "published_at": "2025-10-02T16:45:00", "text": "© 2020\n\nTranslator: PrimayantiEditor: Rahmad NasutionCopyright © ANTARA 2025"}
{"article_id": "20251002164500-5", "source_url": "https://www.dailycamera.com/2025/10/02/abrego-garcia-denied-asylum/", "published_at": "2025-10-02T16:45:00", "text": "e-Edition\n\nSign up for email newsletters\n\nSign up for email newsletters\n\ne-Edition\n\nTrending:\n\nBy TRAVIS LOLLER, Associated Press\n\nNASHVILLE, Tenn. (AP) — A U.S. immigration judge has denieda bid for asylumfromKilmar Abrego Garcia, whose case has become a proxy for the partisan power struggle overimmigration policy.\n\nThe judge in Baltimore on Wednesday rejected an application toreopen Abrego Garcia’s 2019 asylum case, but that is not the final word. Abrego Garcia has 30 days to appeal to the Board of Immigration Appeals.\n\nThe Salvadoran nationalhas an American wife and children and haslived in Marylandfor years, but he immigrated to the United States illegally as a teenager. In 2019, he was arrested by immigration agents. He requested asylum but was not eligible because he had been in the U.S. for more than a year. But the judge ruled hecould not be deported to El Salvador, where he faced danger from a gang that targeted his family.\n\nHe wasmistakenly deportedto El Salvador by President Donald Trump’s administration in March and was held ina notorious prison, and his case soon became a rallying point for those who oppose the Republican president’s immigration crackdown. Facing a ruling from the Supreme Court, the administration returned him to the U.S. in June, only to immediately charge him withhuman smuggling.\n\nAbrego Garcia faces criminal charges in Tennessee, based ona 2022 traffic stop. U.S. Immigration and Customs Enforcement is also seeking to deport him toa third country, proposingUgandafirst and thenEswatini, a small country insouthern Africawhere the king still holds absolute power. His attorneys have denounced the criminal charges and the deportation efforts, saying they arean attempt to punish himfor standing up to the administration.\n\nAbrego Garcia’s request to reopen his asylum case is a calculated risk. If approved, asylum could provide him with a green card and a path to citizenship. But if he loses, an immigration judge could remove his protection from being returned to his native country. That could place him back in the infamousTerrorism Confinement Center, or CECOT. It’s where, he alleges in a lawsuit, he suffered severe beatings, sleep deprivation and psychological torture. El Salvador’s president, Nayib Bukele, hasdenied those allegations.\n\nTrump administration officials have waged a relentless public relations campaign against Abrego Garcia, repeatedly referring to him asa member of the MS-13 gang, among other things, despite the fact he has not been convicted of any crimes.\n\nHis lawyers have filed motionsrequesting a gag orderand say he will not be able to receive a fair trial because of the “highly prejudicial, inflammatory, and false statements” made about him.\n\nWhile the federal judge in Tennessee can order prosecutors there not to make any prejudicial statements about Abrego Garcia, it is unclear whether the judge’s authority extends to the Department of Homeland Security, which posted about the immigration court ruling on X on Wednesday.\n\n“His lawyers tried to fight his removal from the U.S. but one thing is certain, this Salvadoran man is not going to be able to remain in our country,” according to the post.\n\nCopyright © 2025 MediaNews Group"}
{"article_id": "20251002164500-6", "source_url": "https://komonews.com/news/local/christian-religious-revival-group-mayday-usa-sues-seattle-mayor-harrell-cal-anderson-park-rally-arrests-claims-religious-bias-rights-violated-first-amendment", "published_at": "2025-10-02T16:45:00", "text": "Now\n\n57\n\nFri\n\n67\n\nSat\n\n63\n\nTyler Cunnington,KOMONewsReporter\n\nTOPICS:\n\nSEATTLE —The organizers behind a Christian revival rally that was held at Cal Anderson Park in May -- whereprotesters were arrestedwhile clashing with police -- are suing the City of Seattle and Mayor Bruce Harrell over claims their rights were violated.\n\nThe lawsuit claims on behalf of Mayday USA, the group behind a nationwide tour of religious revival messaging, was denied a permit to hold their event along Pike Street due to bias over their religious beliefs, which forced them to go to Cal Anderson Park instead.\n\nThey claim that agitators and protesters intentionally showed up to disrupt their rally, which forced the hand of the Seattle Police Department to shut down the event for the rest of the afternoon, violating their First Amendment rights of expression.\n\nWithin the lawsuit, which spans over 45 pages, Mayday explains that they applied on Feb. 6 to have their event between 1st and 2nd Avenues on Pike Street. It was there that just a year prior, a similar religious event was held.\n\nEmail communications between Mayday organizers and the City of Seattle, show that the city expressed concerns over their worship event being held at the same location, due to overcrowding and blocking access to businesses on the sidewalks.\n\nRELATED |Mayday USA event at Seattle's Cal Anderson Park sparks arrests and controversy\n\nHowever, Mayday expressed that there would be far less people at their rally than there was at the event in 2024.\n\nUltimately in mid-March, the permit was officially denied. The city stated:\n\nThe city had suggested throughout email communications that, instead of the Pike Street location, Mayday should look to use a city park, such as Cal Anderson Park, Westlake Park, or South Lake Union Park.\n\nIt was in April that organizers said they received an approved permit to use Cal Anderson Park.\n\nIt's unclear which parks the group had applied for, other than Cal Anderson, as the lawyer representing Mayday and others, was not available to answer questions during the writing of this article.\n\nA preacher involved with the event also could not provide comment, due to the litigation, but said a statement would be issued soon.\n\nThe event was then held on May 24, which is where organizers claim that \"violent agitators\" physically and verbally threatened them, and people attending the rally, even throwing balloons filled with urine at organizers.\n\nThey also claim that one female protester, while in an area where young children could get free haircuts, \"stripped down to thong underwear and began 'twerking' with her exposed buttocks facing the minor children. The same protester also began (sexually touching herself) in front of minor children at the same location. The same protester was cursing at the children and event staff while engaged in the obscene acts,\" they wrote.\n\nMayday also said that event equipment was destroyed by agitators:\n\n\"Two protesters attacked the event’s stage, ripped down the fabric banners that were attached to the stage, kicked over equipment that was being used on the stage, and otherwise caused damage to the event’s equipment,\" the lawsuit stated.\n\nThe lawsuit further claims that several protesters identifying as ANTIFA closely marched around the children’s haircutting station, wearing Kevlar vests and gas masks while carrying gas cannisters on their utility belts.\n\nAs a result of these disruptions and the safety risk, the organizers said Seattle police officers told them that they needed to shut down their event early.\n\nRELATED |Seattle mayor defends response to rally at park, brushes off FBI investigation threat\n\nThat is where the lawsuit claims the group's 1st Amendment rights were violated.\n\nThe suit also claims that Mayor Bruce Harrell went after Mayday publicly, and solicited the support of several local community voices, such as other religious leaders, to discourage the group's name and their beliefs.\n\n“Seattle is proud of our reputation as a welcoming, inclusive city for LGBTQ+ communities, and we stand with our trans neighbors when they face bigotry and injustice. Today’s far-right rally was held here for this very reason –- to provoke a reaction by promoting beliefs that are inherently opposed to our city’s values, in the heart of Seattle’s most prominent LGBTQ+ neighborhood,\" Harrell wrote within a statement published that same day.\n\nThe lawsuit claims that, \"Mayor Harrell’s Press Release, combined with his own hostile and unconstitutionally discriminatory statements, was designed to demonstrate that the City was permitted to shut down Plaintiffs’ speech and silence their views because they are inherently opposed to our city’s values.”\n\nThey also believed that Harrell was unfairly targeting the religious group in the public spotlight, despite knowing that their permits were denied to go to areas other than Cal Anderson, which was not their first choice.\n\nRELATED |Seattle council member criticizes permit decision for Mayday USA event at Cal Anderson Park\n\nIn conclusion, the lawsuit asks that a judge evaluate five counts of misconduct allegedly carried out by the City of Seattle, Mayor Bruce Harrell, and Seattle Police Chief Shon Barnes:\n\nAs a result of said violations, the plaintiffs ask that the city remove, or amend a multitude of ordinances within their permitting process, due to the belief they infringe upon constitutional rights and/or allow for discretion over groups based on their beliefs.\n\nThey also ask that city streets always be made available and open to the public, such as Pike Street, regardless of who is applying for an event permit.\n\nThe suit adds that a figure for compensatory damages would be determined at trial."}
{"article_id": "20251002164500-7", "source_url": "https://kbat.com/ixp/190/p/budget-friendly-costumes-lubbock/", "published_at": "2025-10-02T16:45:00", "text": "It’s October, which means Halloween is right around the corner. If you’re aLubbockparent, you probably already feel the clock ticking on costumes—especially if you’re planning tomakeone this year instead of buying it. And according to anew survey, a lot of parents are heading down the DIY route in 2025.\n\nThe survey shows that 52% of parents are planning to put together their kids’ costumes themselves. The biggest reason? Saving money. Store-bought costumes have gotten expensive—most average well over $70—and if you’ve got multiple trick-or-treaters to dress, that adds up fast. By comparison, the average homemade costume costs under $40. That’s a big difference for families on a budget here in West Texas.\n\nBut it’s not just about money. Many parents say they’d rather make something unique and creative. Others say the quality of store-bought costumes just isn’t worth the price, or that the ones their kids want simply aren’t available. For some families, making costumes is a yearly tradition—like carving pumpkins or going to a corn maze.\n\nHere’s the twist: 81% of parents admit they feel pressure to make their kids’ costumes “Instagram-worthy.” That might sound silly, but in today’s world, a lot of parents are comparing their creations online.\n\nParents here in Lubbock may not admit it out loud, but you know there’s a little pressure to make sure your kid’s costume stands out at the neighborhood Trunk-or-Treat or the Pumpkin Trail at the Arboretum.\n\nSo what’s hot this year? Pokémon is still a go-to, along with Taylor Swift-inspired costumes.(Don’t be surprised if you see a whole crew of “Eras Tour” kids roaming around Lakeridge on Halloween night.)Labubu, a newer viral character, is making the rounds too. And of course, the classics never go out of style: witches, skeletons, ghosts, vampires, and werewolves will always be part of the mix. Add superheroes and a few creative, one-of-a-kind ideas, and you’ve got a pretty good picture of what Lubbock’s trick-or-treaters will look like this year.\n\nWhether you’re hitting the fabric store or just hot-gluing something together the night before, remember this: your kids probably care more about the fun than perfection. So if you’re a Lubbock parent stressing over that “perfect” DIY costume, take a breath—it doesn’t have to win Instagram. It just has to win Halloween night.\n\nGallery Credit: Landon King\n\nGallery Credit: Landon King"}
{"article_id": "20251002164500-9", "source_url": "https://www.surinametimes.com/artikel/two-year-old-chosen-as-new-living-goddess-by-both-hindus-and-buddhists", "published_at": "2025-10-02T16:45:00", "text": "NEPAL - A two-year-old girl chosen as Nepal’s new living goddess was carried by family members from their home in a Kathmandu alley to a temple palace Tuesday during the...\n\ncountry’s longest and most significant Hindu festival. Aryatara Shakya, at two years and eight months, was chosen as the new Kumari, or ‘virgin goddess’, replacing the incumbent who is considered by tradition to become a mere mortal upon reaching puberty. Kumaris are chosen from the Shakya clans of the Newar community, indigenous to the Kathmandu valley, and revered by both Hindus and Buddhists in the predominantly Hindu nation. The girls are selected between the ages of two and four and are required to have unblemished skin, hair, eyes and teeth. They should not be afraid of the dark. During the Indra Jatra festival earlier this month, the former Kumari was wheeled around on a chariot pulled by devotees. The Kumari always wears red, pins up her hair in topknots, and has a ‘third eye’ painted on their forehead.\n\nThe week-long Indra Jatra festival was the first of a series of celebrations, including Dashain, the main festival, and Tihar, or Diwali, the Festival of Lights, in October. Tuesday marked the eighth day of Dashain, a 15-day celebration of the victory of good over evil. Offices and schools were closed as people celebrated with their families. Family, friends and devotees paraded the new Kumari through the streets of Kathmandu before entering the temple palace which will be her home for several years. “She was just my daughter yesterday, but today she is a goddess,” said her father Ananta Shakya. (Jamaica Gleaner)\n\nGUYANA  -  Roger Simon, a 60-year-old gold miner, was sentenced to two years in jail last Wednesday for the possession of narcotics for the purpose of trafficking.\n\nGUYANA  -  A 38-year-old housewife and a 30-year-old taxi driver were hauled before the Diamond Magistrate’s Court, yesterday and charged with conspiracy to murder...\n\nCANADA - Het geluk leek Curtis Dixon eindelijk toe te lachen: dankzij een geldinzamelingsactie van influencer Zach Dereniowski was de arme...\n\nBij afwezigheid van de geblesseerde spitsen Alassane Pléa, Ricardo Pepi en Myron Boadu koos Peter Bosz voor Guus Til als centrumspits in de Champions...\n\nPARAMARIBO – Binnen de Beveiligings- en Bijstandsdienst Suriname (BBS) rommelt het stevig. Volgens enkele leidinggevenden binnen BBS heerst er chaos,\n\n©2025Times of Suriname – grootste landelijke dagblad van Suriname. All Rights Reserved."}
{"article_id": "20251002164500-10", "source_url": "https://tampabaysmix.iheart.com/content/2025-10-02-nhc-tracking-another-area-of-concern-near-southeast-florida/", "published_at": "2025-10-02T16:45:00", "text": "Photo:Randy Faris / The Image Bank / Getty Images\n\n(Miami, FL) - TheNational Hurricane Centeris now monitoring a new area of potential tropical development close to South Florida.\n\nThe disturbance is expected to form near the northwestern Bahamas or southern Florida by Saturday.\n\nWhile the chance of development remains low (10% over seven days) for now it’s the timing and location are a concern.\n\nForecasters say the system, even if unnamed, will likely bring rain, gusty winds and flooding along Florida’s east coast through the weekend.\n\nThe main storm hazard will be localized flooding especially for coastal counties in south and central Florida.\n\nThe NHC is also tracking another disturbance in the central Atlantic basin that has a 20% chance of development over the next 7 days.\n\nIt may combine with a new tropical wave expected to roll off the coast of Africa in the next few days, according to forecasters.\n\nHurricane Imelda is spinning out to sea; the next named storm will be Jerry."}
{"article_id": "20251002164500-12", "source_url": "https://mynews13.com:443/fl/orlando/news/2025/10/02/advocates-push-for-telemedicine-protections-from-congress-amid-shutdown", "published_at": "2025-10-02T16:45:00", "text": "Get the best experience and stay connected to your community with our Spectrum News app.Learn More\n\nGet the best experience and stay connected to your community with our Spectrum News app.Learn More\n\nContinue in Browser\n\nGet hyperlocal forecasts, radar and weather alerts.\n\nPlease enter a valid zipcode.\n\nSave\n\nORLANDO, Fla. â The government shutdown isnât just impacting federal workers, itâs also raising concerns about continued health care access.\n\nMillions of people around the country, including those in Central Florida and Tampa, have depended on telehealth doctor visits, which includes everything from mental health visits to routine check-ups, and now those users could see a major disruption after the deadline to extend funding for those programs passed on Tuesday.\n\nSince 2020, millions have people have relied on programs that have provided more flexibility around the use of telehealth, and those are initiatives that people have grown to love.\n\nâAnd now theyâre going to have to do that in person requirement once a year after for established patients and then for new patients,\" said American Telemedicine Association Head of Governmental Affairs Alexis Apple. \"I mean, they've got to go in person before they can have that telehealth visit, so unless Congress acts, those in-person requirements will come into place and that's very concerning.â\n\nThe American Telemedicine Association or ATA, is a group that focuses on advancing telehealth and Apple says that theyâre working to convince congress to put in place a retroactive reimbursement provision that would allow for these programs to continue.\n\n\"So, the only viable vehicle right now is the short term continued resolution thatâs going to be passed over the next few days to weeks, who knows at this point,\" Apple shared. \"And so that's really the only way we're going to get these tele-flexibilities extended at this point is if we can get them in this vehicle.â\n\nApple says that these programs have bipartisan support but fears what could come if this shutdown is prolonged.\n\nâBecause we need these providers and hospital systems to be reimbursed for these telehealth services during the shutdown time period,\" Apple explained. \"So, we're actively advocating for a reimbursement or retroactive reimbursement provision to be included in whatever CR language is negotiated at this point.â\n\nBut the fear is that the longer the shutdown lasts, the greater the risk that families in Florida and across the country can lose access to care they count on.\n\nApple says that the ATA has sent letters and apress releaseto Congress and President Donald Trump to try to push the reimbursement provision forward until a long-term solution is in place.\n\nIn the meantime Apple asks everyone impacted by the shutdown of telemedicine to do the same."}
{"article_id": "20251002164500-16", "source_url": "https://www.onegreenplanet.org/vegan-food/stuffed-sweet-potato-recipes/", "published_at": "2025-10-02T16:45:00", "text": "Vegan Cookbooks\n\nHeart Healthy Raw Pecan Spice Delight Cookies [Vegan]\n\nTomato, Chive, and Chickpea Pancakes [Vegan]\n\nPlant-Based Cookbooks to Buy\n\nTroubleshooting Common Issues in Growing Root Vegetables\n\nDiscover Yuzu: Health Benefits and Uses of This Citrus Fruit\n\nPetition: Stop the U.S. Plan to Slaughter Wild Horses in Nevada\n\nPetition: Shut Down Puppy Mills – Ban Raleigh Breeder From Owning Animals\n\nMexico’s Cherished Cactus Faces Extinction as Iconic Dish Hangs in the Balance\n\nArtificial Sweeteners May Speed Up Cognitive Decline, Study Shows\n\nNightmare Bacteria Infections Are Rising and Antibiotic Resistance Is Fueling the Threat\n\nLong Island Zoo Closing After Years of Animal Neglect Allegations\n\nTop Ten Climate Change Myths and How to Debunk Them\n\n5 of the Most Extraordinary Underwater Migrations You Must Know About!\n\nDiscover Why Honey Bees Dance in These 5 Must-See Videos!\n\nThe Impact of Processed Foods on Climate Change\n\nFactory Farms: You Can’t Ignore How It’s Affecting Our Air, Water, and Lives!\n\n5 Eye-Opening Videos Exposing the Dark Side of the Fishing Industry!\n\n10 Greyhound Myths Debunked That Will Change Your Perspective!\n\n3 Tear-Jerking Videos That Prove Elephants Are as Emotional as We Are\n\nThis Beautiful Video Proves a Bad Day Doesn’t Exist When You Adopt a Dog\n\nWho Knew Cows Were This Smart? We Did. (VIDEO)\n\n8 Upcycled Dog Toys to Get Your Dog Thinking\n\n5 Surprising Products That Are Tested On Animals\n\nMust-Have Plant-Based Cookbooks\n\nDiscover Yuzu: Health Benefits and Uses of This Citrus Fruit\n\nExploring the High-Protein, Healthy Profile of Legumes with Recipes\n\n4 Bodyweight Exercises That Stop Muscle Loss After 45\n\nEase Autumn Anxiety: Plant-Based Mood Enhancers That Work\n\nBitter Foods: Unlocking Health Benefits and Cultivating a Taste for Them\n\nUltra-Processed Foods Linked to Declining Male Fertility\n\n10 Deadly Pandemics That Shaped History Long Before Coronavirus Struck!\n\n10 Food Allergens That Can Come From Eggs and Why They Can be Detrimental to Health\n\n17 Exotic Animals People Should Avoid Consuming for Health and Public Safety Reasons\n\n10 Shocking Ways Single-Use Plastics Has Impacted Public Health\n\n19 Most Influential Human Rights Campaigns in History\n\nSay Cheese: Five Animals Who Nailed the Art of Photobombing!\n\n6 Common Dog Behaviors with Wild Roots!\n\n5 Heartbreaking Videos Showing the Reality of Puppy Mills\n\n5 Videos Exposing the Hidden Dangers of Pet Stores!\n\nMicroplastics Are In Our Food Chain and They Are Here to Stay\n\n5 Life Lessons from Our Furry Friends: What Pets Teach Us About Ourselves!\n\nWatch How This Stubborn Dog Hilariously Wakes Dad Up [VIDEO]\n\nDog Loves His Bottomless Red Bucket More Than Anything in the World! [VIDEO]\n\nBunny Turns His Raspberry Snack Into to Adorable Lipstick Look [VIDEO]\n\nCute Rescued Bear Cub Chortles at Lake Tahoe Wildlife Center [VIDEO]\n\nUS Army Sergeant Reunites With His Canine ‘Battle Buddy’ [VIDEO]\n\nWatch Dolphins Perfect Their Headstands in the Water! [VIDEO]\n\nBETTER BURGERS: Make Delicious Nutrient-Rich Burgers Without The Meat\n\nSUMMER:  Stunning Plant-Based Recipes to Enjoy All Season When the Sun's Out\n\nALIVE: Nourishing Plant-Based Meals to Fuel Your Body\n\nGet your favorite articles delivered right to your inbox!\n\nSign upfor daily news from OneGreenPlanet\n\nNo products in the cart.\n\nWe're the Food Monster Editorial Team :)\n\nWhile we enjoy eating potatoes year-round, there’s something particularly special about eatingsweet potatoesin the autumn. Not only are these super spudshighin beta-carotene, an antioxidant that is converted to vitamin A in the human body, but theyalso providethe antioxidant vitamins C and E, as well as vitamin B6, potassium, and manganese.While sweet potatoes can be enjoyedin a numberof different ways, we’re particularly fond of tucking into stuffed sweet potatoes when we need a dose of comfort and good-for-you fuel. Not only are stuffed sweet potato recipes quick and easy, they’re extremely versatile, so you could have a different variation of the meal every night of the week and never feel like you’re eating the same thing.We’ve searched through ourFood Monster Appto showcase some of our favorite and most interesting stuffed sweet potato recipes for you to try this season. Let us know which ones are your faves in the comments below!1. Baked Sweet Potato Stuffed With Turmeric HummusTheseBaked Sweet Potatoes Stuffed With Turmeric Hummusare simple, grain-free, and packed with nutrition. It involves using turmeric hummus as one of the baked sweet potato fillings. After baking sweet potatoes whole, stuff them with a healthy slathering of the hummus, a fresh green salad of spinach leaves, lettuce, mint, and a healthy handful of pomegranate!2. Miso Quinoa Stuffed Sweet PotatoesWe have a flavor party going on that involves a very special, very addicting, very-lick-the-mason-jar kind of miso dressing. This is the kind of combo that makes your taste buds go “boom.”Miso Quinoa Stuffed Sweet Potatoesare topped off with crunchy chickpeas and drizzled with a quick and creamy miso dressing. These stuffed sweet potatoes are the bomb. No exaggerating.3. Loaded Baked Sweet Potatoes With Nacho Cheese and Tempeh BaconLoaded Baked Sweet Potatoes With Nacho Cheese and Tempeh Baconare the perfect comfort food if you need the pick-me-up. The spuds are drizzled with a creamy cashew-based nacho cheese sauce, freshly made guacamole, and smoky tempeh bacon. This dish is easy and you can do most of the prep work while the potatoes bake.4. Charred Corn and Black Bean Stuffed Sweet PotatoesForget pizza and take-out, theseCharred Corn and Black Bean Stuffed Sweet Potatoesare now the ultimate feel-good dish! Top it up with some hearty black beans, some deliciously charred corn, and the perfect garlic-y tahini and you’ve got yourself a meal to cure any heartache! The beans give it a certain rich and earthy meatiness which pairs perfectly with the sweetness of the potato and the corn. Together with the velvety tahini sauce, you’ve got something that is completely addictive and absolutely good for you!5.Kale and Quinoa Stuffed Sweet PotatoesThis easy recipe is perfect for lunch because it’s compact and filled with the fuel you need to get you through the day.Kale and Quinoa Stuffed Sweet Potatoesalso feature toasted almonds.6. Loaded Mexican Sweet Potato SkinsNot only do theseLoaded Mexican Sweet Potato Skinstaste incredible, they provide a tasty way to cut down on your food waste. They are stuffed with spicy beans, guacamole, and sour “cream”. These fully loaded potato skins are perfect for a party or as a starter at dinner.7. Mediterranean Stuffed Sweet Potato BoatsThis budget-friendly meal will leave you daydreaming about the next time you can have this for dinner.Mediterranean Stuffed Sweet Potato Boatsare stuffed with green olives, chickpeas, hummus, and tabbouleh for a filling Mediterranean-inspired meal that will keep you full and satisfied. Serve with greens on the side and top with harissa, if you have it.8. Curry Stuffed Sweet PotatoesCurry Stuffed Sweet Potatoesare cheap, filling, and packed with vitamins and you can get as creative as you want with the stuffing. These roasted sweet potatoes, for example, are stuffed with a warm, spicy curry made from beans, corn, broccoli, and mushrooms and topped with a garlicky tahini sauce. So easy to make and so delicious, you’d never think it’s budget-friendly.9. Baked Sweet Potato With Spinach Chana MasalaABaked Sweet Potato With Spinach Chana Masalais the ultimate, easy comfort food. It’s the perfect dish for a chilly autumn or winter evening with friends.10. Chipotle Chickpeas Stuffed Sweet PotatoThisChipotle Chickpeas Stuffed Sweet Potatotakes the concept of the stuffed baked potato but makes a few modifications for a healthier version. The potato is replaced with a nutritious and vibrant sweet potato, the ground beef with zesty chickpeas, sour cream with a non-dairy variety, and greasy bacon for smoky tempeh strips. The result is a decked out potato that will make your soul feel as good as your taste buds.11. Pecan Pie Twice-Baked Sweet PotatoesYour taste buds are about to cheer because they’re about to embark on a journey to the land of six-ingredient ultra-creamy, sweet, and spicy Thanksgiving side dish glory.Pecan Pie Twice-Baked Sweet Potatoesare covered with a sticky-sweet, crispy pecan topping that gets you right in your comfy-fall-food loving heart. After all, who says you need to leave the creamy, dreamy maple-y, caramel-y, and toasty bursts of flavor for only after dinner?12. Mexican Stuffed Baked Sweet Potato With Cashew CheeseMexican Stuffed Baked Sweet Potato With Cashew Cheeseare vibrant, flavorful, and a breeze to make! Simply bake the potatoes until warm and tender, slice ’em open, and fill with your favorite fixings. This particular recipe is for a Mexican-style potato with avocado, tomato, chili, jalapeño, and some refreshing cashew cheese. Yum!13. Stuffed Breakfast Sweet PotatoWhen talking about sweet potato, despite sweet being in the very name of the food, we’re usually talking about a savory dish. There’s no denying that sweet potato can add some well-needed sweetness to a lunch or dinner entree. But have you ever tried it for breakfast?These Stuffed Breakfast Sweet Potatoesmake for great breakfast side dishes, and in this case, even a vessel for breakfast-y goodness! Feel free to put your own flair on this dish, or enjoy it as presented, with bananas, blueberries, granola, and maple tahini drizzle!14. Chipotle Black Bean Stuffed YamsChipotle Black Bean Stuffed Yamsare loaded with Mexican-inspired flavors! The best thing about this recipe is that it comes together quickly, so they are perfect for a busy day. Pop the yams in the oven while you make the topping and you’ll have the perfect, filling meal in no time!15. Simple Stuffed Breakfast Sweet PotatoesIs there any better way to start your day than withSimple Stuffed Breakfast Sweet Potatoesdripping with almond butter and stuffed with your favorite granola? We don’t think so!If you’re looking for more creative ways to usesweet potatoes, we suggest checking out this feature on15 Unique Ways to Enjoy Sweet Potatoes. Then lean into the autumn season with these15 Must-Make Vegan Sweet Potato Dinners That Are Perfect to Fall.Learn How to Cook Plant-Based Meals at HomeReducing your meat intake and incorporating more plant-based foods into your diet is known toSupportvarious health benefits, including reducingchronic inflammation,improving heart health,enhancing mental well-being,achieving fitness goals,meeting nutritional needs,managing allergies,and promoting gut health, amongothers.Dairy consumption also has been linked to many health problems, includingacne,hormonal imbalance,cancer,prostate cancer, and has manyside effects.For those of you interested in eating more plant-based, we highly recommend grabbing our favoriteplant-based cookbooksand downloading theFood Monster App— with over 20,000 delicious recipes, it is the largest plant-based recipe resource to help reduce your environmental footprint, save animals, and get healthy! And, while you are at it, we encourage you to also learn about theenvironmentalandhealth benefitsof aplant-based diet.Here are some great resources to get you started:Weekly Vegan Meal PlansPlant-Based Health ResourcesPlant-Based Food & RecipesPlant-Based Nutrition ResourcesThe Ultimate Guide to Plant-Based NutritionBudget-Friendly Plant-Based RecipesHigh Protein Plant-Based RecipesPlant-Based Meal PrepPlant-Based CookbooksFor more Animal, Earth, Life, Vegan Food, Health, and Recipe content published daily, subscribe to theOne Green Planet Newsletter! Lastly, being publicly funded gives us a greater chance to continue providing you with high-quality content. Please considersupporting usby donating!Share this:Click to share on Facebook (Opens in new window)FacebookClick to share on X (Opens in new window)XClick to email a link to a friend (Opens in new window)EmailClick to print (Opens in new window)Print\n\nWhile sweet potatoes can be enjoyedin a numberof different ways, we’re particularly fond of tucking into stuffed sweet potatoes when we need a dose of comfort and good-for-you fuel. Not only are stuffed sweet potato recipes quick and easy, they’re extremely versatile, so you could have a different variation of the meal every night of the week and never feel like you’re eating the same thing.\n\nWe’ve searched through ourFood Monster Appto showcase some of our favorite and most interesting stuffed sweet potato recipes for you to try this season. Let us know which ones are your faves in the comments below!\n\nTheseBaked Sweet Potatoes Stuffed With Turmeric Hummusare simple, grain-free, and packed with nutrition. It involves using turmeric hummus as one of the baked sweet potato fillings. After baking sweet potatoes whole, stuff them with a healthy slathering of the hummus, a fresh green salad of spinach leaves, lettuce, mint, and a healthy handful of pomegranate!\n\nWe have a flavor party going on that involves a very special, very addicting, very-lick-the-mason-jar kind of miso dressing. This is the kind of combo that makes your taste buds go “boom.”Miso Quinoa Stuffed Sweet Potatoesare topped off with crunchy chickpeas and drizzled with a quick and creamy miso dressing. These stuffed sweet potatoes are the bomb. No exaggerating.\n\nLoaded Baked Sweet Potatoes With Nacho Cheese and Tempeh Baconare the perfect comfort food if you need the pick-me-up. The spuds are drizzled with a creamy cashew-based nacho cheese sauce, freshly made guacamole, and smoky tempeh bacon. This dish is easy and you can do most of the prep work while the potatoes bake.\n\nForget pizza and take-out, theseCharred Corn and Black Bean Stuffed Sweet Potatoesare now the ultimate feel-good dish! Top it up with some hearty black beans, some deliciously charred corn, and the perfect garlic-y tahini and you’ve got yourself a meal to cure any heartache! The beans give it a certain rich and earthy meatiness which pairs perfectly with the sweetness of the potato and the corn. Together with the velvety tahini sauce, you’ve got something that is completely addictive and absolutely good for you!\n\nThis easy recipe is perfect for lunch because it’s compact and filled with the fuel you need to get you through the day.Kale and Quinoa Stuffed Sweet Potatoesalso feature toasted almonds.\n\nNot only do theseLoaded Mexican Sweet Potato Skinstaste incredible, they provide a tasty way to cut down on your food waste. They are stuffed with spicy beans, guacamole, and sour “cream”. These fully loaded potato skins are perfect for a party or as a starter at dinner.\n\nThis budget-friendly meal will leave you daydreaming about the next time you can have this for dinner.Mediterranean Stuffed Sweet Potato Boatsare stuffed with green olives, chickpeas, hummus, and tabbouleh for a filling Mediterranean-inspired meal that will keep you full and satisfied. Serve with greens on the side and top with harissa, if you have it.\n\nCurry Stuffed Sweet Potatoesare cheap, filling, and packed with vitamins and you can get as creative as you want with the stuffing. These roasted sweet potatoes, for example, are stuffed with a warm, spicy curry made from beans, corn, broccoli, and mushrooms and topped with a garlicky tahini sauce. So easy to make and so delicious, you’d never think it’s budget-friendly.\n\nABaked Sweet Potato With Spinach Chana Masalais the ultimate, easy comfort food. It’s the perfect dish for a chilly autumn or winter evening with friends.\n\nThisChipotle Chickpeas Stuffed Sweet Potatotakes the concept of the stuffed baked potato but makes a few modifications for a healthier version. The potato is replaced with a nutritious and vibrant sweet potato, the ground beef with zesty chickpeas, sour cream with a non-dairy variety, and greasy bacon for smoky tempeh strips. The result is a decked out potato that will make your soul feel as good as your taste buds.\n\nYour taste buds are about to cheer because they’re about to embark on a journey to the land of six-ingredient ultra-creamy, sweet, and spicy Thanksgiving side dish glory.Pecan Pie Twice-Baked Sweet Potatoesare covered with a sticky-sweet, crispy pecan topping that gets you right in your comfy-fall-food loving heart. After all, who says you need to leave the creamy, dreamy maple-y, caramel-y, and toasty bursts of flavor for only after dinner?\n\nMexican Stuffed Baked Sweet Potato With Cashew Cheeseare vibrant, flavorful, and a breeze to make! Simply bake the potatoes until warm and tender, slice ’em open, and fill with your favorite fixings. This particular recipe is for a Mexican-style potato with avocado, tomato, chili, jalapeño, and some refreshing cashew cheese. Yum!\n\nWhen talking about sweet potato, despite sweet being in the very name of the food, we’re usually talking about a savory dish. There’s no denying that sweet potato can add some well-needed sweetness to a lunch or dinner entree. But have you ever tried it for breakfast?These Stuffed Breakfast Sweet Potatoesmake for great breakfast side dishes, and in this case, even a vessel for breakfast-y goodness! Feel free to put your own flair on this dish, or enjoy it as presented, with bananas, blueberries, granola, and maple tahini drizzle!\n\nChipotle Black Bean Stuffed Yamsare loaded with Mexican-inspired flavors! The best thing about this recipe is that it comes together quickly, so they are perfect for a busy day. Pop the yams in the oven while you make the topping and you’ll have the perfect, filling meal in no time!\n\nIs there any better way to start your day than withSimple Stuffed Breakfast Sweet Potatoesdripping with almond butter and stuffed with your favorite granola? We don’t think so!\n\nIf you’re looking for more creative ways to usesweet potatoes, we suggest checking out this feature on15 Unique Ways to Enjoy Sweet Potatoes. Then lean into the autumn season with these15 Must-Make Vegan Sweet Potato Dinners That Are Perfect to Fall.\n\nLearn How to Cook Plant-Based Meals at Home\n\nReducing your meat intake and incorporating more plant-based foods into your diet is known toSupportvarious health benefits, including reducingchronic inflammation,improving heart health,enhancing mental well-being,achieving fitness goals,meeting nutritional needs,managing allergies,and promoting gut health, amongothers.Dairy consumption also has been linked to many health problems, includingacne,hormonal imbalance,cancer,prostate cancer, and has manyside effects.\n\nFor those of you interested in eating more plant-based, we highly recommend grabbing our favoriteplant-based cookbooksand downloading theFood Monster App— with over 20,000 delicious recipes, it is the largest plant-based recipe resource to help reduce your environmental footprint, save animals, and get healthy! And, while you are at it, we encourage you to also learn about theenvironmentalandhealth benefitsof aplant-based diet.\n\nHere are some great resources to get you started:\n\nFor more Animal, Earth, Life, Vegan Food, Health, and Recipe content published daily, subscribe to theOne Green Planet Newsletter! Lastly, being publicly funded gives us a greater chance to continue providing you with high-quality content. Please considersupporting usby donating!\n\nYou must beLoginto post a comment.\n\nThis site uses Akismet to reduce spam.Learn how your comment data is processed.\n\nGet your favorite articles delivered right to your inbox! Sign up for daily news from OneGreenPlanet.\n\nHelp keep One Green Planet free and independent! Together we can ensure our platform remains a hub for empowering ideas committed to fighting for a sustainable, healthy, and compassionate world. Please support us in keeping our mission strong."}
{"article_id": "20251002164500-18", "source_url": "https://jamaica-gleaner.com/article/news/20251002/jutc-developing-security-enabled-student-card-rural-school-bus-network", "published_at": "2025-10-02T16:45:00", "text": "The Jamaica Urban Transit Company (JUTC) is developing a special student card equipped with a built-in security alert feature, designed for use on rural school buses.\n\nMinister of Education, Skills, Youth and Information, Senator Dr Dana Morris Dixon, who made the disclosure during Wednesday’s post-Cabinet press briefing at Jamaica House, urged parents to accompany their children to sign up for the card.\n\n“It is that card that the students will start using very soon to swipe when they go on the bus. When they swipe that card, each parent will get an alert that they have entered the bus. They will get an alert also when they have left the bus,” she explained.\n\nThe National Rural School Bus Programme officially rolled out on September 8, with some 60 buses deployed islandwide.\n\nMorris Dixon expressed satisfaction with the programme’s implementation thus far.\n\n“When I see the joy on our children’s faces when they go on [the school buses], I am reminded that the hard work of fiscal discipline actually can make lives truly better,” she said.\n\nMorris Dixon reminded Jamaicans that students will continue to ride the designated buses free of charge until the end of October. Thereafter, a subsidised fare of $50 per trip will be charged.\n\nMore than 200 schools are currently benefitting from the programme, with additional institutions set to be included in its phased implementation.\n\nTo support this expansion, 40 additional buses are expected to be deployed between September and November.\n\n- JIS News\n\nFollow The Gleaner on X, formerly Twitter, and Instagram @JamaicaGleaner and on Facebook @GleanerJamaica. Send us a message on WhatsApp at 1-876-499-0169 or email us atonlinefeedback@gleanerjm.comoreditors@gleanerjm.com.\n\nView the discussion thread."}
{"article_id": "20251002164500-20", "source_url": "https://kbat.com/ixp/295/p/yes-fragile-2025-tour-set-list/", "published_at": "2025-10-02T16:45:00", "text": "Yeskicked off theFragile Tour 2025last night (Wednesday, Oct. 2) in Wallingford, Connecticut, performing their1971 prog classicin its entirety before an all-new video wall featuring artwork by long-time designer Roger Dean.\n\nThe tour-opening show began with a selection of other Yes favorites, including several songs they hadn't played since 2019: \"Onward,\" \"Madrigal,\" \"Soon\" and \"Tempus Fugit.\" Yes last performed \"Long Distance Runaround\" back in 2016, according toSetlist.fm. They'd never played \"Circles of Time\" from 2023'sMirror to the Sky.\n\nThe encore also included their first-ever live version of aBeatlesdeep cut. See a complete set list, fan-shot and band-shared video, and a run-down of the rest of the tour dates and venues below.\n\nREAD MORE:Ranking Every Yes Song\n\nYes is led by stalwart guitaristSteve Howe. He joined in time for 1971'sThe Yes Album, which immediately precededFragile. The rest of the current Yes lineup includes keyboardist Geoff Downes, vocalist Jon Davison, bassist Billy Sherwood and drummer Jay Schellen.\n\n\"All the band’s albums had a unique feel and approach,\" Howe said in an official statement. \"AfterThe Yes Album, so many things came together, with [co-producer] Eddie Offord steering the proceedings. While the band focused on only four main songs with full arrangements, each of us wrote and designed a solo piece, which was [former drummer] Bill [Bruford]'s great idea. It's fairly 'odd-ball,' but we were at the height of our creativity, determined for success.\"\n\nWatch Yes’ ‘Roundabout’ In Concert\n\nFragilebecame a multi-platinum smash, with signature songs like \"Roundabout,\" \"Long Distance Runaround\" and \"Heart of the Sunrise.\" \"It gave us confidence, further than our own in-stock belief,\" Howe added. \"We'd crafted this unusual but noticeable musical twist to rock and what later became prog.\"\n\nYes' new tour continues through November. Tickets are on sale through the group'sofficial website.\n\nDean's creative relationship dates back to his work on the cover ofFragile. Beyond the video wall, his work will also on display in the merch area at all of these shows. \"The first time I watched the animations with the music was just incredible,\" Dean said in an official statement. \"It’s wonderful that it was so much more powerful with both together.\"\n\nWatch Yes’ ‘Starship Trooper’ In Concert\n\nYes, Oct. 2, 2025 at Wallingford, Connecticut Set List\"Siberian Khatru\"\"On the Silent Wings of Freedom\"\"Onward\"\"Madrigal\"\"Wonderous Stories\"\"Soon\"\"Circles of Time\"\"Tempus Fugit\"Fragile:\"Roundabout\"\"Cans and Brahms\"\"We Have Heaven\"\"South Side of the Sky\"\"Five Per Cent for Nothing\"\"Long Distance Runaround\"\"The Fish (Schindleria Praematurus)\"\"Mood for a Day\"\"Heart of the Sunrise\"Encore:\"The Word\" (Beatles cover)\"Starship Trooper\"\n\nYes, The Fragile Tour 2025, The Album Series10/2 - Morristown, NJ @ Mayo Performing Arts Center10/4 - Atlantic City, NJ @ Hard Rock Live at Etess Arena10/5 - Port Chester, NY @ The Capitol Theatre10/7 - Huntington, NY @ The Paramount10/8-9 - Glenside, PA @ Keswick Theatre10/11 - York, PA @ Appell Center for the Performing Arts10/12 - Jim Thorpe, PA @ Penn's Peak10/14 - Washington, DC @ Warner Theatre10/16 - Durham, NC @ Carolina Theatre10/18 - Clearwater, FL @ Ruth Eckerd Hall10/19 - Ft Lauderdale, FL @ Broward Center, Au-Rene Theater10/21 - The Villages, FL @ Sharon L. Morse Performing Arts Center10/22 - Charleston, SC @ Charleston Music Hall10/24 - Atlanta, GA @ Coca-Cola Roxy10/25 - Memphis, TN @ Graceland Soundstage10/27 - Louisville, KY @ The Louisville Palace10/28 - Cincinnati, OH @ Taft Theatre10/30 - Indianapolis, IN @ Murat Theatre at Old National Centre10/31 - Des Plaines, IL @ Des Plaines Theatre11/1 - St. Charles, IL @ The Arcada Theatre11/3 - Madison, WI @ The Orpheum Theater11/4 - Milwaukee, WI @ The Riverside Theater11/6 - St. Louis, MO @ Stifel Theatre11/7 - Omaha, NE @ Steelhouse Omaha11/9 - Denver, CO @ Paramount Theatre11/11 - Mesa, AZ @ Mesa Arts Center11/13 - Inglewood, CA @ YouTube Theater11/14 - Alpine, CA @ Viejas Casino11/16 - Reno, NV @ Grand Theatre at The Grand Sierra Resort\n\nGallery Credit:Ryan Reed\n\nSteve Howe Released One of Rock’s Most Hated Albums"}
{"article_id": "20251002164500-21", "source_url": "https://abc6onyourside.com/good-day-columbus/warm-up-your-home-with-fall-floral-tips-on-good-day-columbus", "published_at": "2025-10-02T16:45:00", "text": "Now\n\n74\n\nFri\n\n84\n\nSat\n\n86\n\nbyGood Day Columbus\n\nKristen Serpico fromFiori Floralsjoined Good Day Columbus to share some tips with Fall floral trends to warm up your home"}
{"article_id": "20251002164500-22", "source_url": "https://allafrica.com/stories/202510020529.html", "published_at": "2025-10-02T16:45:00", "text": "-The Civil Service Agency says more than 1,000 classroom chairs are nearing completion under President Joseph Nyuma Boakai Sr.'s \"One Chair, One Child\" initiative, financed through salaries withheld from government officials who failed to declare their assets.\n\nCSA Director-General Josiah F. Joekai Jr., speaking Wednesday during a tour of the first batch of chairs at the Monrovia Vocational Training Center (MVTC), said the project is proving skeptics wrong.\n\n\"What many had dismissed as a myth is becoming a tangible achievement,\" Joekai said. \"The money taken from suspended officials is being reinvested in the future of our children.\"\n\nJoekai said the chairs will be turned over to the Ministry of Education for nationwide distribution by November.\n\nKeep up with the latest headlines onWhatsApp|LinkedIn\n\nSkills Training Driving Impact\n\nYouth and Sports Minister Cole Bangalu, who joined the inspection, praised the craftsmanship of MVTC trainees and staff.\n\n\"These chairs are being produced by Liberians, for Liberian children,\" Bangalu said. \"This shows that skills training is not just theoretical -- it can have immediate impact.\"\n\nThe \"One Chair, One Child\" program, launched earlier this year, seeks to reduce the chronic shortage of classroom furniture in public schools.\n\nNationwide Demand Remains High\n\nAssistant Education Minister for General Education Ericson W. Boakai welcomed the first phase of the initiative but stressed that much more is needed.\n\nHe said at least 250,000 chairs are required to meet demand nationwide, as thousands of students still sit on bare floors during lessons.\n\nThe Boakai administration has framed the effort as part of its broader drive to channel public funds toward visible improvements in education and youth development.\n\nRead theoriginal articleonLiberian Investigator.\n\nAllAfrica publishes around 500 reports a day from more than110 news organizationsand over500 other institutions and individuals, representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct.\n\nArticles and commentaries that identify allAfrica.com as the publisher areproduced or commissioned by AllAfrica. To address comments or complaints, pleaseContact us.\n\nAllAfrica is a voice of, by and about Africa - aggregating, producing and distributing 500 news and information items daily from over 110 African news organizations and our own reporters to an African and global public. We operate from Cape Town, Dakar, Abuja, Johannesburg, Nairobi and Washington DC.\n\nGet the latest in African news delivered straight to your inbox\n\nBy submitting above, you agree toour privacy policy.\n\nAlmost finished...\n\nWe need to confirm your email address.\n\nTo complete the process, please follow the instructions in the email we just sent you.\n\nThere was a problem processing your submission. Please try again later."}
{"article_id": "20251002164500-24", "source_url": "https://buffalonews.com/news/local/article_ce0c50eb-2ef2-4cfc-bf15-f18e7e261ff6.html", "published_at": "2025-10-02T16:45:00", "text": "Bishop Michael W. Fisher discusses an agreement that would pay $150 million to settle lawsuits against the Buffalo Diocese by hundreds of plaintiffs accusing priests and other diocese employees of sexually abusing them when they were children.\n\nThe Buffalo Diocese’s first reorganization plan, filed late Wednesday in federal bankruptcy court, contained no major surprises but marked a key milestone in the diocese’s efforts to exit Chapter 11 proceedings.\n\nThe reorganization plan and disclosure statement reiterated the diocese’s intention to settle 891 sex abuse claims with $150 million in diocese, parish and Catholic affiliate entity funds. In addition, three settling insurers have agreed to pay $123.9 million, bringing the total amount of a settlement fund for abuse claimants to $273.9 million.\n\n“Since becoming bishop nearly five years ago, I have continued to assert that we have no higher priority than to work toward the healing of those who have been harmed spiritually, mentally and physically by the crime of sexual abuse, and to provide some semblance of justice and closure,” said Bishop Michael W. Fisher in a statement. “This plan represents our best effort to deliver on that priority, as we also work to define a new, more hopeful era of Catholic faith and impact across our region.”\n\nAbuse claimants would agree to relinquish their rights to sue the diocese, parishes and Catholic affiliates, under the terms of the plan.\n\nThe Buffalo Catholic Diocese has filed its reorganization plan in its ongoing Chapter 11 bankruptcy case.\n\nThe reorganization plan states that abuse claimants and other diocese creditors will end up with a much better deal through Chapter 11 than if the case were converted to a Chapter 7 liquidation, and it encouraged claimants to vote in favor of it.\n\nA dispute has erupted over whether a Catholic foundation will pay $15 million to the Buffalo Diocese to help it fund a sex-abuse settlement.\n\nA vote could take place in early 2026, although it’s likely the reorganization plan will be revised. Ultimately, Chief Judge Carl L. Bucki of U.S. Bankruptcy Court for the Western District of New York must confirm the plan for the diocese to reorganize and exit Chapter 11.\n\nThe diocese is still in the process of securing the $150 million it needs to fulfill the terms of a settlement in principle reached in April with the Official Committee of Unsecured Creditors, which represents the abuse survivors.\n\nDiocese officials have said $80 million of the $150 million will come from the unrestricted cash and savings of the 159 Catholic parishes in eight Western New York counties. The amounts that individual parishes were being asked to contribute toward the settlement varied widely, from less than $10,000 to more than $5 million, sparking outrage among parishioners in churches with the highest contribution amounts.\n\nThe disclosure statement shows the diocese has about $5.8 million in cash, $19.4 million in unrestricted investment funds and multiple properties estimated to generate a total of $22.6 million in net proceeds from their sales. Diocese officials have said in the past that about 80% of diocese unrestricted cash and assets would be used toward settlement.\n\nThe statement doesn’t provide any further details about how the diocese is getting the $150 million, aside from a line stating it may need to take a loan of up to $25 million.\n\nBut the diocese’s efforts to get help from the Foundation for the Roman Catholic Diocese of Buffalo, a separate charitable organization with more than $70 million in assets, have been met with resistance.\n\nThe foundation’s board rejected a diocese request in 2024 for $15 million toward the settlement, and this past June, the board adopted a policy to refuse “any present or future requests” for funding a settlement from the foundation’s unrestricted assets.\n\nThe disclosure statement revealed a host of cost-saving measures adopted by the diocese since it filed for Chapter 11 protection on February 28, 2020.\n\nThose measures include:\n\n• The closing of a priest retirement home, along with plans to close a second priest retirement home in 2026, with a projected savings of $700,000 per year.\n\n• Reduced annual operating expenses and losses of $3.7 million in health and insurance programs.\n\n• The elimination of 40% of diocese workspace, resulting in annual savings of about $4 million.\n\n• Layoffs of 22% of diocese central office staff, about 18 positions total.\n\nState Supreme Court Justice John J. DelMonte on Friday dismissed two lawsuits brought by Catholic parishioners who wanted a court order blocking their parishes from contributing to a $150 million settlement with child sex abuse victims.\n\nThe disclosure statement included a summary of the diocese’s Road to Renewal, an ongoing parish consolidation effort that has irked many Catholics who don’t want their parishes merged and churches closed.\n\nThe statement noted an aging donor base, declining engagement among young Catholics and the looming financial impact of the Chapter 11 case as major “trends of concern” prompting the need for a massive overhaul of the diocese’s parish structure.\n\n“The sad reality is that the Church will be poorer, smaller, and less financially influential in the near future because of the change in demographics and the cost associated with Chapter 11. In preparation for this certain eventuality, communities need to be united and strengthened that they might not scatter,” the statement said. “In the final analysis, the Road to Renewal is a program that looks toward the future and attempts to put the diocese in the best possible position to respond to the pastoral needs of this portion of the People of God.”\n\nTwo of the diocese’s largest insurers, Wausau and CNA, had agreed in August to settle. The disclosure statement showed a third insurer, AIG, has also joined the settlement, agreeing to pay $1.4 million. Several other insurance companies have yet to settle.\n\nIf they do settle later on, the total trust amount could grow even larger.\n\nIf they don’t, the reorganization plan would assign to the settlement trust insurance claims held by the diocese or parishes, allowing for “post-confirmation litigation” to seek recovery from non-settling insurers.\n\nSubscribe to our Daily Headlines newsletter.\n\nReporter\n\nBishop Michael W. Fisher discusses an agreement that would pay $150 million to settle lawsuits against the Buffalo Diocese by hundreds of plai…\n\nBishop Michael Fisher will go to Rome next month to meet with Vatican officials to talk about the Buffalo Diocese's bankruptcy case, and the p…\n\nAt the start, lawyers predicted the Buffalo Diocese bankruptcy could take a year to three years to complete. The multiple delays and legal twi…\n\nTwo primary insurers for the Buffalo Diocese have agreed to pay $122.5 million toward settling nearly 900 child sex abuse claims in federal ba…\n\nA judge heard arguments Tuesday about whether to halt payments from Western New York parishes to the Buffalo Diocese as part of a $150 million…\n\nGet up-to-the-minute news sent straight to your device.\n\nAccount processing issue - the email address may already exist\n\nThank you.\n\nYour account has been registered, and you are now logged in.\n\nCheck your email for details.\n\nInvalid password or account does not exist\n\nSubmitting this form below will send a message to your email with a link to change your password.\n\nAn email message containing instructions on how to reset your password has been sent to the email address listed on your account.\n\nNo promotional rates found.\n\nSecure & Encrypted\n\nSecure transaction.Secure transaction. Cancel anytime.\n\nThank you.\n\nYour gift purchase was successful!Your purchase was successful, and you are now logged in.\n\nA receipt was sent to your email."}
{"article_id": "20251002164500-25", "source_url": "https://www.wdbo.com/news/trending/photos-scenes/AK72ESTEYJALFE7ARA4QINCVVM/", "published_at": "2025-10-02T16:45:00", "text": "This website is unavailable in your location.\n\nIt appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}
{"article_id": "20251002164500-26", "source_url": "https://lasvegassun.com/news/2025/oct/01/pope-intervenes-in-us-abortion-debate-by-raising-w/", "published_at": "2025-10-02T16:45:00", "text": "October 2, 2025\n\nPublished Wednesday, Oct. 1, 2025 | 3:56 a.m.\n\nUpdated 3 hours, 11 minutes ago\n\nROME (AP) — Pope Leo XIV has intervened for the first time in anabortion disputeroiling the U.S. Catholic Church by raising the seeming contradiction over what it really means to be “pro-life.”\n\nLeo, a Chicago native, was asked late Tuesday about plans by Chicago Cardinal Blase Cupich to give a lifetime achievement award to Illinois Senator Dick Durbin for his work helping immigrants. The plans drew objection from some conservative U.S. bishops given the powerful Democratic senator’s support for abortion rights.\n\nLeo called first of all for respect for both sides, but he also pointed out the seeming contradiction in such debates.\n\n“Someone who says ‘I’m against abortion but says I am in favor of the death penalty’ is not really pro-life,” Leo said. “Someone who says that ‘I’m against abortion, but I’m in agreement with the inhuman treatment of immigrants in the United States,’ I don’t know if that’s pro-life.”\n\nLeo, whose words echoed a common Catholic argument often made in discussions about abortion, spoke hours before Cupich announced that Durbin had declined the award.\n\nChurch teaching forbids abortion but it also opposes capital punishment as “inadmissible” under all circumstances. U.S. bishops and the Vatican have strongly called for humane treatment of migrants, citing the Biblical command to “welcome the stranger.”\n\nIn his comments about the Illinois dispute, Leo made no mention of U.S. President Donald Trump, whose administration has carried outa surge of immigration enforcement in the Chicago area.\n\nStill, White House Press Secretary Karoline Leavitt weighed in and disputed concerns raised by Pope Leo about the treatment of immigrants, saying that she “would reject there is inhumane treatment of illegal immigrants in the United States under this administration.”\n\nThe administration, Leavitt said, “is trying to enforce our nation’s laws in the most humane way possible.”\n\nLeo said he wasn’t familiar with the details of the dispute over the Durbin award, but said it was nevertheless important to look at the senator’s overall record and noted Durbin’s four-decade tenure. Responding to a question in English from the U.S. Catholic broadcaster EWTN News, he said there were many ethical issues that constitute the teaching of the Catholic Church.\n\n“I don’t know if anyone has all the truth on them but I would ask first and foremost that there be greater respect for one another and that we search together both as human beings, in that case as American citizens or citizens of the state of Illinois, as well as Catholics to say we need to you know really look closely at all of these ethical issues and to find the way forward in this church. Church teaching on each one of those issues is very clear,” he said.\n\nCupich was a close adviser to Pope Francis, who strongly upheld church teaching opposing abortion but also criticized the politicizing of the abortion debate by U.S. bishops. Some bishops had called for denying Communion to Catholic politicians who supported abortion rights, including former President Joe Biden.\n\nBiden met on several occasions with Francis and told reporters in 2021 that Francis had told him to continue receiving Communion. During a visit to Rome that year hereceived the sacramentduring Mass at a church in Francis’ diocese.\n\nDurbin was barred from receiving Communion in his home diocese of Springfield in 2004. Springfield Bishop ThomasPaprocki has continued the prohibitionand was one of the U.S. bishops who strongly objected to Cupich's decision to honor the senator. Cupich claims Durbin as a member of the Chicago Archdiocese, where Durbin also has a home.\n\nIn his statement announcing that Durbin would decline the award, Cupich lamented that the polarization in the U.S. has created a situation where U.S. Catholics “find themselves politically homeless” since neither the Republican nor the Democratic party fully encapsulates the breadth of Catholic teaching.\n\nHe defended honoring Durbin for his pro-immigration stance, and said the planned Nov. 3 award ceremony could have been an occasion to engage him and other political leaders with the hope of pressing the church’s view on other issues, including abortion.\n\n“It could be an invitation to Catholics who tirelessly promote the dignity of the unborn, the elderly, and the sick to extend the circle of protection to immigrants facing in this present moment an existential threat to their lives and the lives of their families,” Cupich wrote.\n\nPaprocki, for his part, thanked Durbin for declining the award. “I ask that all Catholics continue to pray for our church, our country, and for the human dignity of all people to be respected in all stages of life including the unborn and immigrants,” Paprocki said in a Facebook post.\n\n___\n\nAssociated Press religion coverage receives support through the AP’scollaborationwith The Conversation US, with funding from Lilly Endowment Inc. The AP is solely responsible for this content.\n\nLocally owned and independent since 1950; Winner of the Pulitzer Prize for Public Service, best news website in the nation & DuPont Award for broadcast journalism\n\nFollow us:\n\n© Las Vegas Sun,2025, All Rights Reserved\n\n© Las Vegas Sun Mobile"}
{"article_id": "20251002164500-27", "source_url": "https://www.wzzm13.com/article/news/local/attorney-general-dana-nessel-government-shutdown-scam-warning/69-ae08437a-ab21-406a-a3e7-63509149a325", "published_at": "2025-10-02T16:45:00", "text": "GRAND RAPIDS, Mich. — Attorney General Dana Nessel is warning of possible imposter scams amid the federal government shutdown.\n\nThe shutdown started Wednesday after Congress couldn't reach an agreement on the budget. Senate Democrats say they won’t vote for a funding measure unless Republicans include an extension of expiring health care benefits, among other demands, while President Donald Trump and his fellow Republicans are refusing to negotiate.\n\nNessel said scammers may take advantage of the situation to impersonate a government agency or official in an attempt to get sensitive information. This could include false claims about Social Security, Medicare, Medicaid or SNAP benefits.\n\n\"I know a government shutdown can cause uneasiness and uncertainty for many families,” Nessel said. “Scammers take advantage of those fears to try to steal money and personal information. The best defense is to stay calm and verify details directly with the government agency.”\n\nWhile the Attorney General's Office has not yet received any reports of these impersonator scams, Michiganders are asked to stay alert.\n\nIf you receive a text, phone call or email from a scammer, you're asked to do the following:\n\nAttorney General Nessel is also reminding consumers that government agencies:\n\nYou can report a scam to the Attorney General's Officeonlineor by contacting theConsumer Protection Teamat:\n\nP.O. Box 30213Lansing, MI 48909517-335-7599Fax: 517-241-3771Toll-free: 877-765-8388\n\nCopyright 2025 Associated Press. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\n\nTo stream 13OYS on your phone, you need the 13OYS app.\n\nNext up in5\n\nExample video title will go here for this video\n\nNext up in5\n\nExample video title will go here for this video\n\nIn Other News"}
{"article_id": "20251002164500-29", "source_url": "https://www.eastidahonews.com/2025/10/idaho-kids-lost-health-insurance-at-record-rates-from-2022-to-2024-report-finds/", "published_at": "2025-10-02T16:45:00", "text": "Idaho Falls news, Rexburg news, Pocatello news, East Idaho news, Idaho news, education news, crime news, good news, business news, entertainment news, Feel Good Friday and more.\n\n54℉\n\nBOISE (Idaho Capital Sun) — The rate of children in Idaho without health insurance rose the second fastest in the nation recently, a new report found.\n\nFrom 2022 to 2024, Idaho’s child uninsured rate rose from 5.7% to 8.1% — growing Idaho’s number of uninsured children from 28,000 to 40,000 kids, according to a report released earlier this month by Georgetown University’s Center for Children and Families.\n\nThe report analyzed health insurance rates for children across the country as states started to remove people from Medicaid after pandemic-era enrollment protections ended. That process, called Medicaid unwinding, contributed to Idaho’s sharp rise in the rate of uninsured children, the center’s executive director, Joan Alker, said at a webinar earlier this month.\n\n“All it takes is one broken arm on the school playground to financially devastate a family already struggling to make ends meet,“ Ivy Walker, a policy associate at the health advocacy group Idaho Voices for Children, said in a statement. “The number of Idaho children going without health insurance should be a wake-up call for Idaho policymakers and the unfortunate truth is that children’s access to health care is about to get much worse.”\n\nIdaho did Medicaid unwinding fast, and most Idahoans who lost Medicaid through the process were removed for not replying to the state’s requests for information, the Idaho Capital Sun previously reported. Almost three-quarters of the nearly 50,000 kids who lost Medicaid were removed from the health insurance public assistance program for non-responses, Idaho Voices for Children said in a news release Tuesday.\n\nThe group called on Idaho’s congressional delegation to help by extending enhanced premium tax credits families can use to buy discounted private health insurance through the state’s exchange.\n\nThe credits are set to expire at the end of this year, and Congress hasn’t extended them. Without the credits, 35,000 Idahoans could lose health insurance because of steep premium hikes, the Sun previously reported.\n\nSUBMIT A CORRECTION\n\nWe hope you appreciated this story.   \t\tA small team of local journalists runs EastIdahoNews.com – not a big business or corporation. Our stories are produced to inform and serve the public. We don't have a paywall or require a subscription to use EastIdahoNews.com, but there is a cost associated with bringing you stories every day. Please consider supporting us just once for $1 or, if you're able, contribute a little more monthly or annually. We sincerely appreciate your consideration.\n\nDonation amount:$\n\n© 2015 - 2025 EastIdahoNews.com LLC"}
{"article_id": "20251002164500-31", "source_url": "https://www.ross-shirejournal.co.uk/news/national/camouflage-claim-made-by-mail-publisher-lawyers-in-high-court-battle-141969/", "published_at": "2025-10-02T16:45:00", "text": "HomeNewsNationalArticle\n\nLawyers for the publisher of the Daily Mail newspaper have claimed “camouflage” may have been used in a legal battle over allegations of unlawful information gathering.\n\nThe Duke of Sussex and six other high-profile individuals, including Sir Elton John, his husband David Furnish and actress Liz Hurley, are bringing legal action against Associated Newspapers Limited (ANL).\n\nThe group has accused the publisher of carrying out or commissioning unlawful activities such as hiring private investigators to place listening devices inside cars, “blagging” private records, commissioning burglary to order and accessing private phone conversations.\n\nActress Sadie Frost, campaigner Baroness Doreen Lawrence and politician Sir Simon Hughes are also in the group.\n\nANL firmly denies the allegations and is defending the legal action, previously describing the claims as “lurid” and “simply preposterous”.\n\nThe second day of a preliminary hearing at the High Court was heard on Thursday, with no findings yet made in respect of the allegations, ahead of an expected trial in January.\n\nThe London court heard submissions over the disclosure of documents held by a research team on the side of the seven individuals and about who legally has control over them.\n\nAntony White KC, for ANL, said it was “highly likely” that the research team had relevant documents, particularly about when some of the people in the cases knew they might have a claim.\n\nIn written submissions, the barrister said articles may have been published on the website Byline “with a view to deterring ANL” from arguing that Sir Simon’s claims were brought too late, recommended by a member of the research team.\n\nMr White said it appeared that Sir Simon could then use the articles to claim that he became aware of certain information as a result of their publication.\n\nThe barrister described this as “limitation camouflage”, telling the court: “You only need camouflage if you have got something to hide.”\n\nMr White asked the judge to order “proper” searches for documents that, if not followed, could mean the claims would be thrown out.\n\nDavid Sherborne, for the seven individuals, described the allegation about Sir Simon’s case as “simply untrue” and said they will respond “in detail”.\n\nHe continued in written submissions: “The statements of case are the place for making, and responding to, such allegations, if they are seriously to be countenanced, and not in satellite disclosure proceedings when no barriers to reasonable searches have been erected.”\n\nThe barrister later said another allegation was “misconceived” and refuted a claim that lawyers for the group had engaged in “cherry picking” of disclosed documents, adding that the research team had offered searches.\n\n“The research team was engaged in April 2022; the claimants consider the document, or documents, underpinning that engagement to be protected by legal professional privilege,” Mr Sherborne added.\n\nHe later said the requested order would be a “nuclear option” that was not needed in this case, continuing: “This is not a situation where the claimants have sought to breach an order and are contumelious.”\n\nThe hearing before Mr Justice Nicklin is due to conclude on Thursday with a decision expected in writing in early October."}
{"article_id": "20251002164500-33", "source_url": "https://www.architecturaldigest.com/story/where-does-morgan-wallen-live", "published_at": "2025-10-02T16:45:00", "text": "He prides himself on being “that boy from EastTennessee,” but where does Morgan Wallen live now that he’s a country hitmaker? A decade after he emerged into the spotlight as a contestant onThe Voice, Wallen still resides in his home state. “You watch TV shows, and all they do is make fun of people like that,” the singersaidin 2021 of his Southern upbringing. “I want to bring some praise and pride in being from there, and I can only do that if I’m tapped into it.” To this day, it doesn’t seem like theI’m the Problemsinger plans to leave the region anytime soon.\n\nSince the outset of his career, Wallen has lived in and aroundNashville, at the heart of the country music scene. As his level of fame has risen (andhis scandalsmultiplied), Wallen has retreated to a more private home life, opting for a sprawlingfarmjust outside Music City—away from the prying eyes of the public. It’s just as well for the “You Proof” singer, who is an avid outdoorsman. “There’s nothin’ I love more than being with friends around a campfire, on a boat, or in a deer stand,” Wallensaidin 2024. Plus, as the small-town native toldPeoplein 2021, it’s necessary for him to stay close to his rural roots: “I’m not gonna know what to sing about if I get too far removed!”\n\nRead on to learn more about the singer’s real estate investments.\n\nIn April 2020, Wallen closed on a $700,000 house in Nashville’s Melrose neighborhood. The dwelling was part of a 2015-built structure, which comprised two attached side-by-side homes, each with their own entrance, garage, and driveway; the country singer resided in the one on the left. ThePrairie-inspiredhome had neutral, contemporary-style interiors spanning 2,759 square feet, with four bedrooms and three baths. Theliving roomfeatured a tiled fireplace and built-in shelves, while the kitchen had a long island with a breakfast bar, lots of gray cabinetry, and French door access to a fenced-in backyard with a small patio and grassy lawn. There was also a roof deck and an upper floor primary suite with a spacious walk-in closet and a bathroom that featured a tiled chaise built into the glass-walled shower.\n\nDuring his tenancy there, Wallen welcomed a son, Indigo Wilder, with his ex, KT Smith. “We’re doing our best to figure it out, just trying to do the best we can with the situation,” the singersaid in January 2021in regards to coparenting with his former girlfriend. “I mean, many people have been in this situation before—having a kid with someone you’re not with—but knowing that doesn’t make it any easier.” Unsurprisingly, being a new parent left its mark on Wallen’s home. At six months old, Indigo began sleeping overnight at the singer’s Nashville dwelling. “So if you walk in my house now, you think a baby lives here,” he toldPeopleat the time.\n\nWallen’s most infamous public misstep occurred in the home’s driveway in February 2021, when a frustrated neighbor recorded a video of him loudly arriving home late at night after drinking with friends. In the clip, whichTMZpublished, Wallen can be heard using a racial slur. In the ensuing fallout, it seemed that the musician’s career would be severely impacted; he was briefly suspended by his label, disqualified from multiple awards, and his music was pulled from the radio. Within a few months, howeve—after apologizing, donating to charities, and a stint spent outside of the spotlight (including 30 days in rehab in San Diego, as Wallen toldGood Morning America)—the musician was back in business, with his popularity continuing to surge. “Our actions matter. Our words matter. And I want to encourage anyone that is watching to please learn from my mistake. There’s no reason to downplay what I did,” hesaidat the time.\n\nThe incident seemingly left the “Whiskey Glasses” singer wanting a fresh start and a more private abode. Hesold the propertyin July 2021 for $835,000.\n\nThese days, Wallen has no shortage of space outside of the public eye. According to a December 2023 cover story forBillboard, the singer bought 1,700 acres of land outside of Nashville that year with his friend and booking agent Austin Neal. Wallen previously mentioned his desire to buy a farm in a 2021 interview withPeople. “I don’t know exactly how much land, but I’d like to have some trails and also some fields, and hunt a little bit, maybe a pond to fish on,” he said. The expansive property that Wallen ultimately chose has plenty of wild space to hunt deer, perBillboard—and not much else is known about it. That’s by design for the chart-topping musician, who spends less time in public as his star continues to rise. “Everything has gotten so, so huge,” he toldBillboard. “I don’t really go to the grocery store. I have to go through back doors to go to the doctor and all that kind of stuff. I still try to hold on to as much [normalcy] as possible. I like driving, so I try to drive as much as I can by myself.” Other than that, Wallen can be found enjoying his privacy at home. “I play my shows, I hang out with my son, and I hide pretty much. And I’m OK with that. I’m happy as hell with that.”\n\nThough he doesn’t live there, there is one more locale (that we know of) tied to Wallen. In June 2024, the singer partnered with TC Restaurant Group to opena six-story establishmentin downtown Nashville, Morgan Wallen’s This Bar & Tennessee Kitchen. The eatery gets its name from the title of a song on Wallen’s 2021 album,Dangerous,and boasts three stages for live musical performances, six bars, a rooftop deck, and a menu featuring some of Wallen’s mother’s recipes. “What started as a chart-topping hit, This Bar is now a place that promises an experience that is authentic to the essence of Morgan’s music and the celebration of the state of Tennessee,” reads the bar’s website.\n\nSo, where will Wallen buy property next? Tennessee feels like a safe guess.\n\nA Puerto Rican Design Team Literally Moved Mountains for Bad Bunny’s Residency\n\n6 Fashion Icons Share How They “Dress” Their Homes\n\nSoccer Player Ben Chilwell’s Home Brings California-Cool to Surrey, England\n\nRevisiting Robert Redford’s Western Retreat in Sundance, Utah\n\nThe Sound of Music: 5 Secrets From the Sets of the Beloved Film\n\nDownton Abbey: The Grand Finale—Get the First Look at the New Sets\n\nThe Sexiest Midcentury Homes inADOpen Door History\n\nActor Christopher Meloni Had One Request For His West Village Sanctuary: 360-Degree Views\n\nNot a subscriber?JoinADfor print and digital access now.\n\nBrowse theAD PRO Directoryto find anAD-approved design expert for your next project.\n\n©2025Condé Nast. All rights reserved.Architectural Digestmay earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad Choices"}
{"article_id": "20251002164500-36", "source_url": "https://www.boredpanda.com/pregnant-woman-angry-husband-eats-emergency-snacks/?cexp_id=136497&cexp_var=2&_f=homepage_featured", "published_at": "2025-10-02T16:45:00", "text": "No fees, cancel anytime\n\nLog In\n\nor\n\nSign Up\n\nor\n\nReset your password\n\nEnter your email address or username and we’ll send you a link to reset your password\n\nCheck your inbox\n\nAn email with a link to reset your password was sent to the email address associated with your account\n\nProvide email\n\nPlease enter your email to complete registration\n\nActivate to continue\n\nYour account isn't active yet. We've emailed you an activation link. Please check your inbox and click the link to activate your account\n\nThe Bored Panda iOS app is live!Fight boredom with iPhones and iPadshere.\n\nJoin 1.2 million Panda readers who get the best art, memes, and fun stories every week!\n\nP.S. It's 100% free, unsubscribe anytime.\n\nYou're on the list! Expect to receive your first email very soon!\n\nDiscover trivia, brain teasers, and quirky quizzes — fresh every week!\n\nWe value your inbox – it's free and you can unsubscribe anytime with one click.\n\n24\n\n24\n\nLink copied!\n\nShare\n\nLink copied!\n\nShare\n\nPregnancyis difficult enough on its own. Growing a human, hormones all over the place, morning sickness, and endless physical changes—it’s a lot to handle.\n\nFor this woman, it was even tougher because she also suffers from hypoglycemic episodes, or low blood sugar, which became much worse during pregnancy. To cope, she kept emergency snacks on hand for when the symptoms hit.\n\nSo you can imagine her frustration when, one day, those snacks were gone—eaten by her husband since they were the easiest thing to grab. Exhausted and overwhelmed, she blew up at him. Now she’s askingReddit: did she overreact?\n\nPregnant woman holding her belly and looking distressed, showing signs of tension with angry husband over emergency snacks.\n\nShare icon\n\nImage credits:Bizon / freepik (not the actual photo)\n\nPregnant woman frustrated as angry husband eats emergency snacks meant for hypoglycemia episodes.\n\nText about a pregnant woman discussing hypoglycemia during pregnancy with her angry husband eating emergency snacks nearby.\n\nPregnant woman looking upset while husband eats emergency snacks in the kitchen during a tense moment.\n\nText on white background reading: Even doing this, sometimes I get hypoglycemic episodes out of nowhere.\n\nPregnant woman excitedly reaching for emergency snacks on a plate while sitting at a table in a home setting.\n\nShare icon\n\nImage credits:freepik (not the actual photo)\n\nPregnant woman looking frustrated as angry husband eats emergency snacks, causing tension in the kitchen.\n\nPregnant woman looking upset while her husband eats emergency snacks in the kitchen during a tense moment.\n\nPregnant woman angry as husband eats emergency snacks, showing frustration during intense hunger episode.\n\nPregnant woman looking frustrated while her angry husband eats emergency snacks from the kitchen.\n\nMan with beard eating a sandwich indoors, reflecting the pregnant woman angry husband eats emergency snacks theme.\n\nShare icon\n\nImage credits:kroshka__nastya / freepik (not the actual photo)\n\nText excerpt about a pregnant woman frustrated with her husband who eats her emergency snacks too quickly.\n\nShare icon\n\nPregnant woman frustrated as angry husband eats her emergency snacks without asking, causing tension at home.\n\nPregnant woman upset as angry husband eats emergency snacks, causing frustration during a sensitive moment.\n\nPregnant woman angry at husband eating emergency snacks while he explains he was late and needed something easy.\n\nPregnant woman angry at husband eating emergency snacks while feeling tired from pregnancy and chasing a toddler.\n\nPregnant woman looking frustrated and upset, holding crumpled tissue, reacting to husband eating emergency snacks.\n\nShare icon\n\nImage credits:EyeEm / freepik (not the actual photo)\n\nPregnant woman upset as husband eats emergency snacks meant for quick nutrition and easy access during pregnancy.\n\nText showing frustration about a husband eating emergency snacks that are needed by pregnant woman.\n\nPregnant woman looking frustrated with husband eating emergency snacks, highlighting tension and upset feelings.\n\nImage credits:pregnant-and-tired\n\nShare icon\n\nImage credits:DC Studio / freepik (not the actual photo)\n\nOne of the hardest parts of being in arelationshipis when you tell your partner something they do is upsetting, they nod along, maybe even promise to stop, and then go right back to doing it.\n\nThat’s exactly what this woman was dealing with. She had explained to her husband many times that her emergency snacks were off-limits because she needed them for hypoglycemia episodes, especially during pregnancy. Yet time and time again, he still ate them.\n\nIt’s a very common issue and something many couples struggle with. At the root of it is the fact that people often find it extremely difficult to change their habits or behavior, even when they know it matters.\n\nCarol Simmons, PhD, LCSW, a psychotherapist at Kaiser Permanente, toldVerywell Mindthat “change can be a scary word for many people. It’s a difficult topic and should be managed with great sensitivity.”\n\nThe problem is, when a partner doesn’t follow through after you’ve raised an issue, it creates frustration and resentment. Over time, it can even wear down the closeness in your relationship. And honestly—when it’s about health, not just food, who wouldn’t be upset?\n\nSo what can help when you feel stuck in this cycle?\n\nAccording to Verywell Mind, the first step is remembering you can’t control your partner, you can only control how you respond.\n\nIf you’ve had the same fight over and over, try a different approach. That might mean being very clear about how serious the issue is, or deciding you won’t rehash the argument endlessly and stepping away instead. Sometimes even small changes in how you react can shift the conversation.\n\nExperts also point out that it helps to put things into perspective. Simmons recommends rating the problem on a scale from 1 to 10 to figure out whether it’s something you can compromise on or if it’s a deal-breaker. In this woman’s case, her health was at stake, so her anger made perfect sense, and it’s something that should be communicated that way.\n\nDr. John Gottman, clinical psychologist and founder of the Gottman Institute,saysthat how couples communicate about uncomfortable topics often predicts whether the relationship will last.\n\nHis advice is to bring up the things that frustrate you in a non-confrontational way and not when you’re both stressed in the moment. Instead, find a time when you can actually have a productive conversation. He also notes that it helps to frame your words so your partner hears more about what you do want, rather than only what you don’t.\n\nAt the end of the day, if your partner is willing to listen and try, there’s usually a way forward. But if they keep brushing it off, especially when it involves yourhealth, you may need to think seriously about what you’re willing to tolerate.\n\nPregnant woman frustrated as husband eats emergency snacks, highlighting tensions over pregnancy care and food needs.\n\nPregnant woman looking upset as her angry husband eats emergency snacks, highlighting tension over pregnancy needs.\n\nScreenshot of a Reddit comment discussing angry husband who eats emergency snacks, highlighting lack of respect for pregnant woman.\n\nText post discussing the serious risks when a pregnant woman’s husband eats emergency snacks needed for medical reasons.\n\nPregnant woman looking upset while her angry husband eats emergency snacks at home.\n\nComment about pregnant woman angry husband eating emergency snacks, highlighting lack of consideration and self-restraint.\n\nScreenshot of an online comment discussion about a pregnant woman angry at husband who eats emergency snacks.\n\nComment about pregnant woman angry husband eating emergency snacks, questioning his manners and compassion.\n\nComment screenshot showing a user defending pregnant woman’s need for emergency snacks against an angry husband’s dismissive behavior.\n\nPregnant woman upset as husband angrily eats emergency snacks, highlighting tension over snack control.\n\nComment criticizing a husband eating emergency snacks, highlighting the pregnant woman's anger and concern for her health condition.\n\nAngry husband eating emergency snacks while pregnant woman looks upset, highlighting pregnancy snack conflicts.\n\nComment text on screen, expressing frustration about not being treated like a mother providing after-school snacks.\n\nComment from user Fancy_Complaint4183 advising to keep emergency snacks hidden to avoid conflict with angry husband eating them.\n\nPregnant woman frustrated with angry husband eating emergency snacks meant for her and the baby after not replacing them.\n\nAngry husband eating emergency snacks while pregnant woman looks upset, highlighting pregnancy and urgent snack needs.\n\nPregnant woman frustrated as angry husband eats emergency snacks, causing tension over health and snack supplies.\n\nPregnant woman frustrated as angry husband eats emergency snacks meant for her pregnancy cravings at home.\n\nShare icon\n\nPregnant woman upset as husband eats emergency snacks meant for medical low blood sugar treatment.\n\nShare icon\n\nBy entering your email and clicking Subscribe, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to ourPrivacy Policy.\n\nThank you! You've successfully subscribed to newsletters!\n\nAnyone can write on Bored Panda.Start writing!\n\nFollow Bored Panda onGoogle News!\n\nFollow us onFlipboard.com/@boredpanda!\n\n24\n\n24\n\n24\n\n24\n\nLink copied!\n\nShare\n\nLink copied!\n\nShare\n\nWriter,BoredPanda staff\n\nOleksandra is an experienced copywriter from Ukraine with a master’s degree in International Communication. Having covered everything from education, finance, and marketing to art, pop culture, and memes, she now brings her storytelling skills to Bored Panda. For the past five years, she’s been living and working in Vilnius, Lithuania.\n\nWriter,BoredPanda staff\n\nOleksandra is an experienced copywriter from Ukraine with a master’s degree in International Communication. Having covered everything from education, finance, and marketing to art, pop culture, and memes, she now brings her storytelling skills to Bored Panda. For the past five years, she’s been living and working in Vilnius, Lithuania.\n\n\"He takes great care of me...\". Really? So you're here posting about the 'great care' he takes of you, not the fact that the inconsiderate bàstard can't stop stuffing his face with snacks you've put aside for your 'care'?\n\nI would take an enormous amount of money of the shared bankaccount and buy a ridiculous amount of snacks and stuff his car so full of snacks so he will never again ask for snacks in his life.\n\nYet another \"my partner is perfect in everyway... except in this one thing that's a giant red flag.\"\n\n\"He takes great care of me...\". Really? So you're here posting about the 'great care' he takes of you, not the fact that the inconsiderate bàstard can't stop stuffing his face with snacks you've put aside for your 'care'?\n\nI would take an enormous amount of money of the shared bankaccount and buy a ridiculous amount of snacks and stuff his car so full of snacks so he will never again ask for snacks in his life.\n\nYet another \"my partner is perfect in everyway... except in this one thing that's a giant red flag.\"\n\n1comment20 points\n\n1comment24 points\n\n1comment21 points\n\n3comments27 points\n\n3replies20 points\n\n4comments34 points\n\n6comments32 points\n\n28replies18 points\n\n4replies21 points\n\n1comment14 points"}
{"article_id": "20251002164500-38", "source_url": "https://www.11alive.com/article/syndication/smart-deals/stackcommerce/this-270-shipment-of-18-wines-is-now-only-70/608-0ac1c04d-1a54-411d-9d16-abbdc333f1f0", "published_at": "2025-10-02T16:45:00", "text": "Credit: Swirl\n\nThis station earns commissions on purchases made through the link(s) on this page.\n\nTL;DR:Get 18 bottles of red, white, or mixed wines right to your door fromSwirl Wine Shopfor only $69.97 plus shipping.\n\nGood wine does not have to come with a big price tag. With this limited-time offer fromSwirl Wine Shop, you can fill your rack with 18 full-size bottles for just $69.97 plus shipping (reg. $270). This isn’t a subscription, and there aren’t any hidden fees.\n\nWhen you make your purchase here, you’ll receive a digital voucher that is redeemed on Swirl’s website, where you can choose an all-red case, an all-white case, or a mixed set that includes reds, whites, and a refreshing rosé. Shipping is a flat $39.95 for all 18 bottles. Each 750ml bottle is selected for balanced, fruit-forward flavor rather than heavy complexity, so they are easy to pair with food or enjoy on their own.\n\nThe red collection brings juicy berry notes and smooth textures that complement grilled meats and pasta dishes. Whites lean crisp and refreshing, ideal for porch sipping or seafood nights. The mixed case has something for every mood, from a bright Spanish Garnacha Tempranillo to a Washington State Chardonnay with green apple and lime. Buyers must be 21 or older, and an adult signature is required at delivery.\n\nWhether you’re a wine lover stocking up or just preparing for the holidays, this is a great way to get a lot of wine at a low price.\n\nUntil October 12 at 11:59 p.m. PT, you can get 18 Bottles of Red, White, or Mixed Wines fromSwirl Wine Shopfor $69.97.\n\nSwirl Wine Shop – 18 Bottles of Red, White or Mixed Wines for just $79 (Shipping Not Included)\n\nSee Deal\n\nStackSocialprices subject to change.\n\nStackSocialworks with a variety of merchants and brands to bring you deals worth talking about. We partner with affiliates to bring exclusive and lifetime offers to readers worldwide, helping consumers discover over five million products and counting.\n\nTo stream 11Alive on your phone, you need the 11Alive app.\n\nNext up in5\n\nExample video title will go here for this video\n\nNext up in5\n\nExample video title will go here for this video\n\nIn Other News"}
{"article_id": "20251002164500-39", "source_url": "http://readme.readmedia.com/Lebanon-Valley-College-Announces-2025-26-Student-Government-Members/merit-194391", "published_at": "2025-10-02T16:45:00", "text": "Lebanon Valley College's Student Government is tasked with fostering understanding, communication, and cooperation among students, faculty, and administrators.To view these students click here:https://lvc.meritpages.com/achievements/Lebanon-Valley-College-Announces-2025-26-Student-Government-Members/194391\n\nLebanon Valley College's Student Government is tasked with fostering understanding, communication, and cooperation among students, faculty, and administrators.\n\nAli Wenger, 717-867-6034, awenger@lvc.edu\n\n...more\n\nreadMedia, Inc.915 BroadwayAlbany, NY 12207"}
{"article_id": "20251002164500-40", "source_url": "https://www.dailypolitical.com/2025/10/02/consolidated-planning-corp-has-3-74-million-stock-position-in-invesco-sp-500-equal-weight-etf-rsp.html", "published_at": "2025-10-02T16:45:00", "text": "Posted byJeff WilderonOct 2nd, 2025\n\nConsolidated Planning Corp decreased its stake in  Invesco S&P 500 Equal Weight ETF (NYSEARCA:RSP–Free Report) by 1.6% during the 2nd quarter, according to the company in its most recent Form 13F filing with the Securities and Exchange Commission. The fund owned 20,570 shares of the company’s stock after selling 343 shares during the period. Consolidated Planning Corp’s holdings in Invesco S&P 500 Equal Weight ETF were worth $3,738,000 at the end of the most recent reporting period.\n\nSeveral other hedge funds and other institutional investors have also modified their holdings of the stock. Clarity Financial LLC grew its stake in shares of  Invesco S&P 500 Equal Weight ETF by 9.6% in the second quarter. Clarity Financial LLC now owns 1,375 shares of the company’s stock worth $250,000 after acquiring an additional 120 shares during the last quarter.  TPG Advisors LLC grew its stake in shares of  Invesco S&P 500 Equal Weight ETF by 73.6% in the second quarter. TPG Advisors LLC now owns 4,476 shares of the company’s stock worth $813,000 after acquiring an additional 1,897 shares during the last quarter.  B.O.S.S. Retirement Advisors LLC acquired a new stake in shares of  Invesco S&P 500 Equal Weight ETF in the second quarter worth $206,000.  Centricity Wealth Management LLC grew its stake in shares of  Invesco S&P 500 Equal Weight ETF by 45.0% in the second quarter. Centricity Wealth Management LLC now owns 10,120 shares of the company’s stock worth $1,839,000 after acquiring an additional 3,142 shares during the last quarter.  Finally, Trust Co. of Vermont grew its stake in shares of  Invesco S&P 500 Equal Weight ETF by 11.1% in the second quarter. Trust Co. of Vermont now owns 3,031 shares of the company’s stock worth $551,000 after acquiring an additional 303 shares during the last quarter. Institutional investors and hedge funds own  61.18% of the company’s stock.\n\nShares ofInvesco S&P 500 Equal Weight ETF stockopened at $190.13 on Thursday. The company has a market cap of $75.37 billion, a price-to-earnings ratio of 20.10 and a beta of 1.05. Invesco S&P 500 Equal Weight ETF has a 1 year low of $150.35 and a 1 year high of $190.54. The company’s fifty day simple moving average is $187.07 and its 200-day simple moving average is $178.91.\n\n(Free Report)\n\nGuggenheim S&P 500 Equal Weight ETF, formerly Rydex S&P 500 Equal Weight ETF, seeks to replicate as closely as possible, the daily performance of the S&P 500 Equal Weight Index (the Index). The Index is a capitalization-weighted index covering 500 industrial, utility, transportation and financial companies of the United States markets (mostly NYSE Euronext issues).\n\nReceive News & Ratings for Invesco S&P 500 Equal Weight ETF Daily- Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Invesco S&P 500 Equal Weight ETF and related companies withMarketBeat.com's FREE daily email newsletter.\n\nMcKesson Corporation $MCK Shares Bought by Consolidated Planning Corp\n\nCHURCHILL MANAGEMENT Corp Sells 983 Shares of iShares Russell 1000 Value ETF $IWD"}
{"article_id": "20251002164500-41", "source_url": "https://abc6onyourside.com/good-day-columbus/saucebox-promises-a-flavorful-journey-with-wine-and-food-in-columbus-on-october-12th", "published_at": "2025-10-02T16:45:00", "text": "Now\n\n74\n\nFri\n\n84\n\nSat\n\n86\n\nbyGood Day Columbus\n\nTOPICS:\n\nGood Day Columbus had a preview of\"Saucebox: A Midwestern Affair with Wine and Food\"which is coming to downtown Columbus on October 12th."}
{"article_id": "20251002164500-42", "source_url": "https://kcycountry.iheart.com/featured/bobby-bones/content/2025-10-01-late-night-barking-drama-at-lunchboxs-hotel/", "published_at": "2025-10-02T16:45:00", "text": "Lunchboxhad some late-night drama during a hotel stay, and it had nothing to do with his own room.\n\nAt12:15 a.m.one night and at1:15 a.m.the next night, the room next door had a dog that would not stop barking. A little yapper, going off in the middle of the night. Frustrated, Lunchbox even recorded audio of the barking through the wall as proof. He eventually called the front desk to complain, then fell asleep, so he never actually found out what happened next.\n\nWhen morning came and it was time to check out, Lunchbox decided to bring it up again. He told the staff about the barking again and asked for a discount on his room. The worker explained the manager wasn’t there and he’d have to wait for a follow-up.\n\nThat sparked some debate.Bobbyargued that Lunchbox had no case. If he really wanted a solution, he should’ve asked to be moved to a new room that night. Since he already stayed and then asked for a discount after the fact, Bobby said the hotel didn’t owe him anything. Thehotel manager later emailedLunchbox with the same sentiment, saying they were sorry for the inconvenience, but if he had spoken up sooner, they could’ve moved him. After the stay was over, there wasn’t much they could do.\n\nSo in the end, Lunchbox was left with no discount, just a story."}
{"article_id": "20251002164500-44", "source_url": "https://dailygalaxy.com/2025/10/alien-civilizations-distant-galaxies/", "published_at": "2025-10-02T16:45:00", "text": "A new study explores how radio-bright galaxies may reveal the existence of advanced civilizations.\n\nRecent research suggests that galaxies with high radio emissions—known as “radio-bright” galaxies—could be home to alien civilizations. This idea, explored in Brian C. Lacki’sstudyArtificial Broadcasts as Galactic Populationsfrom theBreakthrough Listen Initiative, offers a fresh approach to the search for extraterrestrial intelligence (SETI) by expanding the focus beyond individual stars to entire galaxies.\n\nFor decades,SETIhas focused on detecting artificialradio signals, assuming that alien civilizations would emit detectable signals into space. The traditional model involves looking for these emissions in nearby star systems, particularly those that might support habitable planets. However, as astronomer Brian C. Lacki proposes, the search may need to expand beyond individual stars to entire galaxies, particularly those with strong radio emissions.\n\nLacki’s research, as part of the Breakthrough Listen Initiative, explores how galaxies that appear unusually bright in radio waves might indicate the presence of advanced civilizations. These civilizations could be using radio broadcasts, either deliberately or unintentionally, which would stand out against the galaxy’s natural radio emissions. As Lacki explains,\n\n“If you have some subset that has a lot of radio transmissions, they will appear radio-bright.”\n\nThis insight suggests that such galaxies could host multiple civilizations, each potentially broadcasting at various frequencies.\n\nYet, the challenge lies in distinguishing between natural emissions and those generated by intelligent beings.According to Lacki,\n\n“The trouble is that you can’t tell whether that emission is natural or artificial just from knowing how bright it is in the radio… For an individual galaxy, all you can do is set an upper limit based on the total radio emission.”\n\nThis limitation means that even with advanced detection methods, we can’t easily pinpoint which emissions might be the result of alien activity.\n\nOne of the key concepts in Lacki’s study is theKardashevscale, which measures the technological advancement of a civilization based on its energy consumption. A Type I civilization uses the energy of a planet, Type II harnesses the power of a star, and Type III civilizations can tap into the energy of an entire galaxy. While such civilizations may seem hypothetical, the Kardashev scale offers a way to think about how these advanced societies might interact with their environments, particularly through energy-intensive activities like radio transmission.\n\nLacki’s research suggests that the likelihood of encountering such civilizations through radio emissions is extremely low. He notes,\n\n“What my work shows is that Type IIIs in this original sense—ETIs that broadcast the luminosity of an entire galaxy in radio waves—are very rare. Less than 1 in 100,000 galaxies the size of the Milky Way can host one.”\n\nThis finding emphasizes that detecting such civilizations would be an extraordinary feat, and only a small fraction of galaxies are likely to show the kind of radio emissions that SETI surveys are looking for.\n\nA major challenge in detecting extraterrestrial signals lies in what Lacki calls the “collective bound” ofradio emissions.This term refers to the total amount of radio energy emitted by a galaxy, taking into account both natural and potential artificial sources. As galaxies naturally produce significant amounts of radio emissions—due to phenomena like active galactic nuclei (AGN) powered by supermassive black holes—separating natural from artificial signals is a daunting task.\n\n“If you’re applying the collective bound to an individual galaxy, you actually want to look for galaxies that are as faint in the radio as possible while still having a large number of stars,”Lacki explains.However, the universe is filled with radio-bright galaxies, and they are rare, which means that the search for artificial signals needs to be precise and expansive. This is where the power of large-scale radio surveys becomes crucial in setting upper limits on the number of galaxies that could potentially harbor broadcasting civilizations.\n\nWhile the focus has traditionally been on detecting radio signals, Lacki and other researchers propose expanding the scope ofSETI surveysto include other forms of technosignatures. As we consider the possibility of extraterrestrial civilizations broadcasting across the universe, it’s essential to explore other potential emissions, including X-rays, gamma rays, and infrared radiation. These signals could indicate the presence of technologies that manipulate energy in ways we have yet to fully understand.\n\n“In the past few years, various researchers have been setting upper limits on radio transmissions in other galaxies by looking for ones that just happen to be near stars that we are observing in SETI and might be caught by luck,” Lacki notes. This method, though useful, suggests that a more thorough and targeted approach is needed. By expandingSETI’s searchto include a wider range of frequencies and cosmic phenomena, scientists might improve their chances of detecting technosignatures from other civilizations.\n\nAn editor specializing in astronomy and space industry, passionate about uncovering the mysteries of the universe and the technological advances that propel space exploration. lydia@dailygalaxy.com\n\nThe Daily Galaxy --Great Discoveries Channel is an independent media. Support us by adding us to your Google News favorites:\n\nComment\n\nSave my name, email, and website in this browser for the next time I comment.\n\n© 2024 | Daily Galaxy  | All rights reserved"}
{"article_id": "20251002164500-48", "source_url": "https://99kisscountry.iheart.com/content/2025-10-02-missing-womans-body-found-behind-homes-secret-attic-entrance/", "published_at": "2025-10-02T16:45:00", "text": "Photo:Irina Pislari / iStock / Getty Images\n\nPolice in Vallejo, California, discoveredthe body ofRenia Lewis, a 28-year-old woman who had been missing since Friday (September 26), behind a secret entrance to an atticin a Northern California home. Authorities arrestedDouglas Irwin Shaw, 41, on suspicion of murder. The Vallejo Police Department has not yet identified a motive or confirmed whether Lewis and Shaw knew each other.\n\nLewis was last seen on Friday evening and wasreported missing on Sunday(September 28). Aan initial search of a home in Vallejo, where Lewis was believed to have been, did not reveal her whereabouts. However, on Monday, police activated an \"Ebony Alert,\" a system designed to help locate missing Black individuals, and obtained a search warrant for a more thorough investigation.\n\nDuring this search,officers found a concealed entry to the attic and discovered Lewis' remains. Shaw was arrested at his workplace on Tuesday (September 30) and allegedly admitted to the killing. He is currently being held without bail at the Solano County Jail.\n\nVallejo Police ChiefJason Tadescribed the incident as \"a heartbreaking, senseless act of violence\" and expressed pride in the officers and detectives for resolving the case.\n\nThe investigation is ongoing, and Shaw's legal representation has not been clarified."}
{"article_id": "20251002164500-49", "source_url": "https://kiss951.com/2025/10/02/kane-brown-teases-edm-ep-unspoken-embraces-yeedm-genre-fusion/", "published_at": "2025-10-02T16:45:00", "text": "Music star Kane Brown plans to release an electronic dance EP. His first track, \"Unspoken,\" was released on streaming services on October 2.\n\nThis move into electronic sounds builds on his past work. Back in 2019, his track with Marshmello, \"One Thing Right,\" toppedBillboard's Hot Country Songslist. The mix of twang and beats struck gold.\n\nIn 2024, Brown kept pushing limits. He worked with Marshmello again on \"Miles On It.\" Then came \"Next To You\" with DVBBS and Loud Luxury. That track hit number 12 on Billboard's dance charts — not bad for a country kid.\n\nBrown first hinted at his new direction while featuring on Logan Paul's podcast. His timing makes sense. More fans want this mix of boots and beats, the walls between music styles falling down. The fusion of genres has been quollocially dubbed \"YeeDM.\"\n\nBig festivals now mix it up too. At Stagecoach, DJs spin next to guitar pickers. Even Electric Daisy Carnival made space for \"YeeDC\" — where banjos meet bass drops.\n\nEarlier this year, Brown released his albumThe High Road. The album gave fans \"Fiddle in the Band,\" \"Rescue,\" and \"Body Talk.\" His newest single, \"2 Pair,\" came out in June.\n\nBrown has always liked to mix things up. He's made music with soul singer Khalid, rapper Swae Lee, and piano man John Legend, saysHoller Country.\n\nFans can stay up-to-date on the latest byvisiting Brown's website.\n\nDownload the app to LISTEN LIVE wherever you are and connect with us like never before!"}
